Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
/*
 * Component description for ETH
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-11-28T06:55:10Z */
#ifndef _PIC32CKSG01_ETH_COMPONENT_H_
#define _PIC32CKSG01_ETH_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR ETH                                          */
/* ************************************************************************** */

/* -------- ETH_SAB : (ETH Offset: 0x00) (R/W 32) Specific Address Bottom [31:0] Register -------- */
#define ETH_SAB_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SAB) Specific Address Bottom [31:0] Register  Reset Value */

#define ETH_SAB_ADDR_Pos                      _UINT32_(0)                                          /* (ETH_SAB) Specific Address 1 Position */
#define ETH_SAB_ADDR_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_SAB_ADDR_Pos)           /* (ETH_SAB) Specific Address 1 Mask */
#define ETH_SAB_ADDR(value)                   (ETH_SAB_ADDR_Msk & (_UINT32_(value) << ETH_SAB_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_SAB register */
#define ETH_SAB_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_SAB) Register Mask  */


/* -------- ETH_SAT : (ETH Offset: 0x04) (R/W 32) Specific Address Top [47:32] Register -------- */
#define ETH_SAT_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SAT) Specific Address Top [47:32] Register  Reset Value */

#define ETH_SAT_ADDR_Pos                      _UINT32_(0)                                          /* (ETH_SAT) Specific Address 1 Position */
#define ETH_SAT_ADDR_Msk                      (_UINT32_(0xFFFF) << ETH_SAT_ADDR_Pos)               /* (ETH_SAT) Specific Address 1 Mask */
#define ETH_SAT_ADDR(value)                   (ETH_SAT_ADDR_Msk & (_UINT32_(value) << ETH_SAT_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_SAT register */
#define ETH_SAT_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_SAT) Register Mask  */


/* -------- ETH_AE : (ETH Offset: 0x119C) ( R/ 32) Alignment Errors Register -------- */
#define ETH_AE_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_AE) Alignment Errors Register  Reset Value */

#define ETH_AE_AER_Pos                        _UINT32_(0)                                          /* (ETH_AE) Alignment Errors Position */
#define ETH_AE_AER_Msk                        (_UINT32_(0x3FF) << ETH_AE_AER_Pos)                  /* (ETH_AE) Alignment Errors Mask */
#define ETH_AE_AER(value)                     (ETH_AE_AER_Msk & (_UINT32_(value) << ETH_AE_AER_Pos)) /* Assigment of value for AER in the ETH_AE register */
#define ETH_AE_Msk                            _UINT32_(0x000003FF)                                 /* (ETH_AE) Register Mask  */


/* -------- ETH_BCFR : (ETH Offset: 0x115C) ( R/ 32) Broadcast Frames Received Register -------- */
#define ETH_BCFR_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_BCFR) Broadcast Frames Received Register  Reset Value */

#define ETH_BCFR_BFRX_Pos                     _UINT32_(0)                                          /* (ETH_BCFR) Broadcast Frames Received without Error Position */
#define ETH_BCFR_BFRX_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_BCFR_BFRX_Pos)          /* (ETH_BCFR) Broadcast Frames Received without Error Mask */
#define ETH_BCFR_BFRX(value)                  (ETH_BCFR_BFRX_Msk & (_UINT32_(value) << ETH_BCFR_BFRX_Pos)) /* Assigment of value for BFRX in the ETH_BCFR register */
#define ETH_BCFR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_BCFR) Register Mask  */


/* -------- ETH_BCFT : (ETH Offset: 0x110C) ( R/ 32) Broadcast Frames Transmitted Register -------- */
#define ETH_BCFT_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_BCFT) Broadcast Frames Transmitted Register  Reset Value */

#define ETH_BCFT_BFTX_Pos                     _UINT32_(0)                                          /* (ETH_BCFT) Broadcast Frames Transmitted without Error Position */
#define ETH_BCFT_BFTX_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_BCFT_BFTX_Pos)          /* (ETH_BCFT) Broadcast Frames Transmitted without Error Mask */
#define ETH_BCFT_BFTX(value)                  (ETH_BCFT_BFTX_Msk & (_UINT32_(value) << ETH_BCFT_BFTX_Pos)) /* Assigment of value for BFTX in the ETH_BCFT register */
#define ETH_BCFT_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_BCFT) Register Mask  */


/* -------- ETH_BFR64 : (ETH Offset: 0x1168) ( R/ 32) 64 Byte Frames Received Register -------- */
#define ETH_BFR64_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_BFR64) 64 Byte Frames Received Register  Reset Value */

#define ETH_BFR64_NFRX_Pos                    _UINT32_(0)                                          /* (ETH_BFR64) 64 Byte Frames Received without Error Position */
#define ETH_BFR64_NFRX_Msk                    (_UINT32_(0xFFFFFFFF) << ETH_BFR64_NFRX_Pos)         /* (ETH_BFR64) 64 Byte Frames Received without Error Mask */
#define ETH_BFR64_NFRX(value)                 (ETH_BFR64_NFRX_Msk & (_UINT32_(value) << ETH_BFR64_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_BFR64 register */
#define ETH_BFR64_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_BFR64) Register Mask  */


/* -------- ETH_BFT64 : (ETH Offset: 0x1118) ( R/ 32) 64 Byte Frames Transmitted Register -------- */
#define ETH_BFT64_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_BFT64) 64 Byte Frames Transmitted Register  Reset Value */

#define ETH_BFT64_NFTX_Pos                    _UINT32_(0)                                          /* (ETH_BFT64) 64 Byte Frames Transmitted without Error Position */
#define ETH_BFT64_NFTX_Msk                    (_UINT32_(0xFFFFFFFF) << ETH_BFT64_NFTX_Pos)         /* (ETH_BFT64) 64 Byte Frames Transmitted without Error Mask */
#define ETH_BFT64_NFTX(value)                 (ETH_BFT64_NFTX_Msk & (_UINT32_(value) << ETH_BFT64_NFTX_Pos)) /* Assigment of value for NFTX in the ETH_BFT64 register */
#define ETH_BFT64_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_BFT64) Register Mask  */


/* -------- ETH_CSE : (ETH Offset: 0x114C) ( R/ 32) Carrier Sense Errors Register -------- */
#define ETH_CSE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_CSE) Carrier Sense Errors Register  Reset Value */

