Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
#define ETH_CSE_CSR_Pos                       _UINT32_(0)                                          /* (ETH_CSE) Carrier Sense Error Position */
#define ETH_CSE_CSR_Msk                       (_UINT32_(0x3FF) << ETH_CSE_CSR_Pos)                 /* (ETH_CSE) Carrier Sense Error Mask */
#define ETH_CSE_CSR(value)                    (ETH_CSE_CSR_Msk & (_UINT32_(value) << ETH_CSE_CSR_Pos)) /* Assigment of value for CSR in the ETH_CSE register */
#define ETH_CSE_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_CSE) Register Mask  */


/* -------- ETH_CTRLA : (ETH Offset: 0x00) (R/W 32) CTRLA Register -------- */
#define ETH_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_CTRLA) CTRLA Register  Reset Value */

#define ETH_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (ETH_CTRLA) Software Reset Bit Position */
#define ETH_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << ETH_CTRLA_SWRST_Pos)               /* (ETH_CTRLA) Software Reset Bit Mask */
#define ETH_CTRLA_SWRST(value)                (ETH_CTRLA_SWRST_Msk & (_UINT32_(value) << ETH_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the ETH_CTRLA register */
#define ETH_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (ETH_CTRLA) Macro Enable Position */
#define ETH_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << ETH_CTRLA_ENABLE_Pos)              /* (ETH_CTRLA) Macro Enable Mask */
#define ETH_CTRLA_ENABLE(value)               (ETH_CTRLA_ENABLE_Msk & (_UINT32_(value) << ETH_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the ETH_CTRLA register */
#define ETH_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (ETH_CTRLA) Run in standby mode Position */
#define ETH_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << ETH_CTRLA_RUNSTDBY_Pos)            /* (ETH_CTRLA) Run in standby mode Mask */
#define ETH_CTRLA_RUNSTDBY(value)             (ETH_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << ETH_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the ETH_CTRLA register */
#define ETH_CTRLA_Msk                         _UINT32_(0x00000043)                                 /* (ETH_CTRLA) Register Mask  */


/* -------- ETH_CTRLB : (ETH Offset: 0x04) (R/W 32) CTRLB Register -------- */
#define ETH_CTRLB_RESETVALUE                  _UINT32_(0xC0)                                       /*  (ETH_CTRLB) CTRLB Register  Reset Value */

#define ETH_CTRLB_GMIIEN_Pos                  _UINT32_(0)                                          /* (ETH_CTRLB) Select GMII/MII mode Position */
#define ETH_CTRLB_GMIIEN_Msk                  (_UINT32_(0x1) << ETH_CTRLB_GMIIEN_Pos)              /* (ETH_CTRLB) Select GMII/MII mode Mask */
#define ETH_CTRLB_GMIIEN(value)               (ETH_CTRLB_GMIIEN_Msk & (_UINT32_(value) << ETH_CTRLB_GMIIEN_Pos)) /* Assigment of value for GMIIEN in the ETH_CTRLB register */
#define ETH_CTRLB_GBITCLKREQ_Pos              _UINT32_(1)                                          /* (ETH_CTRLB) Gigabit clock request Position */
#define ETH_CTRLB_GBITCLKREQ_Msk              (_UINT32_(0x1) << ETH_CTRLB_GBITCLKREQ_Pos)          /* (ETH_CTRLB) Gigabit clock request Mask */
#define ETH_CTRLB_GBITCLKREQ(value)           (ETH_CTRLB_GBITCLKREQ_Msk & (_UINT32_(value) << ETH_CTRLB_GBITCLKREQ_Pos)) /* Assigment of value for GBITCLKREQ in the ETH_CTRLB register */
#define ETH_CTRLB_TSUCLKREQ_Pos               _UINT32_(2)                                          /* (ETH_CTRLB) TSU Clock Request Position */
#define ETH_CTRLB_TSUCLKREQ_Msk               (_UINT32_(0x1) << ETH_CTRLB_TSUCLKREQ_Pos)           /* (ETH_CTRLB) TSU Clock Request Mask */
#define ETH_CTRLB_TSUCLKREQ(value)            (ETH_CTRLB_TSUCLKREQ_Msk & (_UINT32_(value) << ETH_CTRLB_TSUCLKREQ_Pos)) /* Assigment of value for TSUCLKREQ in the ETH_CTRLB register */
#define ETH_CTRLB_TSUMS_Pos                   _UINT32_(5)                                          /* (ETH_CTRLB) Timer Adjust Position */
#define ETH_CTRLB_TSUMS_Msk                   (_UINT32_(0x1) << ETH_CTRLB_TSUMS_Pos)               /* (ETH_CTRLB) Timer Adjust Mask */
#define ETH_CTRLB_TSUMS(value)                (ETH_CTRLB_TSUMS_Msk & (_UINT32_(value) << ETH_CTRLB_TSUMS_Pos)) /* Assigment of value for TSUMS in the ETH_CTRLB register */
#define ETH_CTRLB_TSUINC_Pos                  _UINT32_(6)                                          /* (ETH_CTRLB) Timer Adjust Mode Position */
#define ETH_CTRLB_TSUINC_Msk                  (_UINT32_(0x3) << ETH_CTRLB_TSUINC_Pos)              /* (ETH_CTRLB) Timer Adjust Mode Mask */
#define ETH_CTRLB_TSUINC(value)               (ETH_CTRLB_TSUINC_Msk & (_UINT32_(value) << ETH_CTRLB_TSUINC_Pos)) /* Assigment of value for TSUINC in the ETH_CTRLB register */
#define ETH_CTRLB_Msk                         _UINT32_(0x000000E7)                                 /* (ETH_CTRLB) Register Mask  */


/* -------- ETH_DCFGR : (ETH Offset: 0x1010) (R/W 32) DMA Configuration Register -------- */
#define ETH_DCFGR_RESETVALUE                  _UINT32_(0x20704)                                    /*  (ETH_DCFGR) DMA Configuration Register  Reset Value */

#define ETH_DCFGR_FBLDO_Pos                   _UINT32_(0)                                          /* (ETH_DCFGR) Fixed Burst Length for DMA Data Operations: Position */
#define ETH_DCFGR_FBLDO_Msk                   (_UINT32_(0x1F) << ETH_DCFGR_FBLDO_Pos)              /* (ETH_DCFGR) Fixed Burst Length for DMA Data Operations: Mask */
#define ETH_DCFGR_FBLDO(value)                (ETH_DCFGR_FBLDO_Msk & (_UINT32_(value) << ETH_DCFGR_FBLDO_Pos)) /* Assigment of value for FBLDO in the ETH_DCFGR register */
#define ETH_DCFGR_ESMA_Pos                    _UINT32_(6)                                          /* (ETH_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses Position */
#define ETH_DCFGR_ESMA_Msk                    (_UINT32_(0x1) << ETH_DCFGR_ESMA_Pos)                /* (ETH_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses Mask */
#define ETH_DCFGR_ESMA(value)                 (ETH_DCFGR_ESMA_Msk & (_UINT32_(value) << ETH_DCFGR_ESMA_Pos)) /* Assigment of value for ESMA in the ETH_DCFGR register */
#define ETH_DCFGR_ESPA_Pos                    _UINT32_(7)                                          /* (ETH_DCFGR) Endian Swap Mode Enable for Packet Data Accesses Position */
#define ETH_DCFGR_ESPA_Msk                    (_UINT32_(0x1) << ETH_DCFGR_ESPA_Pos)                /* (ETH_DCFGR) Endian Swap Mode Enable for Packet Data Accesses Mask */
#define ETH_DCFGR_ESPA(value)                 (ETH_DCFGR_ESPA_Msk & (_UINT32_(value) << ETH_DCFGR_ESPA_Pos)) /* Assigment of value for ESPA in the ETH_DCFGR register */
#define ETH_DCFGR_RXBMS_Pos                   _UINT32_(8)                                          /* (ETH_DCFGR) Receiver Packet Buffer Memory Size Select Position */
#define ETH_DCFGR_RXBMS_Msk                   (_UINT32_(0x3) << ETH_DCFGR_RXBMS_Pos)               /* (ETH_DCFGR) Receiver Packet Buffer Memory Size Select Mask */
#define ETH_DCFGR_RXBMS(value)                (ETH_DCFGR_RXBMS_Msk & (_UINT32_(value) << ETH_DCFGR_RXBMS_Pos)) /* Assigment of value for RXBMS in the ETH_DCFGR register */
#define ETH_DCFGR_TXPBMS_Pos                  _UINT32_(10)                                         /* (ETH_DCFGR) Transmitter Packet Buffer Memory Size Select Position */
#define ETH_DCFGR_TXPBMS_Msk                  (_UINT32_(0x1) << ETH_DCFGR_TXPBMS_Pos)              /* (ETH_DCFGR) Transmitter Packet Buffer Memory Size Select Mask */
#define ETH_DCFGR_TXPBMS(value)               (ETH_DCFGR_TXPBMS_Msk & (_UINT32_(value) << ETH_DCFGR_TXPBMS_Pos)) /* Assigment of value for TXPBMS in the ETH_DCFGR register */
#define ETH_DCFGR_TXCOEN_Pos                  _UINT32_(11)                                         /* (ETH_DCFGR) Transmitter Checksum Generation Offload Enable Position */
#define ETH_DCFGR_TXCOEN_Msk                  (_UINT32_(0x1) << ETH_DCFGR_TXCOEN_Pos)              /* (ETH_DCFGR) Transmitter Checksum Generation Offload Enable Mask */
#define ETH_DCFGR_TXCOEN(value)               (ETH_DCFGR_TXCOEN_Msk & (_UINT32_(value) << ETH_DCFGR_TXCOEN_Pos)) /* Assigment of value for TXCOEN in the ETH_DCFGR register */
#define ETH_DCFGR_DRBS_Pos                    _UINT32_(16)                                         /* (ETH_DCFGR) DMA Receive Buffer Size Position */
#define ETH_DCFGR_DRBS_Msk                    (_UINT32_(0xFF) << ETH_DCFGR_DRBS_Pos)               /* (ETH_DCFGR) DMA Receive Buffer Size Mask */
#define ETH_DCFGR_DRBS(value)                 (ETH_DCFGR_DRBS_Msk & (_UINT32_(value) << ETH_DCFGR_DRBS_Pos)) /* Assigment of value for DRBS in the ETH_DCFGR register */
#define ETH_DCFGR_DDRP_Pos                    _UINT32_(24)                                         /* (ETH_DCFGR) DMA Discard Receive Packets Position */
#define ETH_DCFGR_DDRP_Msk                    (_UINT32_(0x1) << ETH_DCFGR_DDRP_Pos)                /* (ETH_DCFGR) DMA Discard Receive Packets Mask */
#define ETH_DCFGR_DDRP(value)                 (ETH_DCFGR_DDRP_Msk & (_UINT32_(value) << ETH_DCFGR_DDRP_Pos)) /* Assigment of value for DDRP in the ETH_DCFGR register */
#define ETH_DCFGR_Msk                         _UINT32_(0x01FF0FDF)                                 /* (ETH_DCFGR) Register Mask  */


