Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
/* -------- ETH_DTF : (ETH Offset: 0x1148) ( R/ 32) Deferred Transmission Frames Register -------- */
#define ETH_DTF_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_DTF) Deferred Transmission Frames Register  Reset Value */

#define ETH_DTF_DEFT_Pos                      _UINT32_(0)                                          /* (ETH_DTF) Deferred Transmission Position */
#define ETH_DTF_DEFT_Msk                      (_UINT32_(0x3FFFF) << ETH_DTF_DEFT_Pos)              /* (ETH_DTF) Deferred Transmission Mask */
#define ETH_DTF_DEFT(value)                   (ETH_DTF_DEFT_Msk & (_UINT32_(value) << ETH_DTF_DEFT_Pos)) /* Assigment of value for DEFT in the ETH_DTF register */
#define ETH_DTF_Msk                           _UINT32_(0x0003FFFF)                                 /* (ETH_DTF) Register Mask  */


/* -------- ETH_EC : (ETH Offset: 0x1140) ( R/ 32) Excessive Collisions Register -------- */
#define ETH_EC_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_EC) Excessive Collisions Register  Reset Value */

#define ETH_EC_XCOL_Pos                       _UINT32_(0)                                          /* (ETH_EC) Excessive Collisions Position */
#define ETH_EC_XCOL_Msk                       (_UINT32_(0x3FF) << ETH_EC_XCOL_Pos)                 /* (ETH_EC) Excessive Collisions Mask */
#define ETH_EC_XCOL(value)                    (ETH_EC_XCOL_Msk & (_UINT32_(value) << ETH_EC_XCOL_Pos)) /* Assigment of value for XCOL in the ETH_EC register */
#define ETH_EC_Msk                            _UINT32_(0x000003FF)                                 /* (ETH_EC) Register Mask  */


/* -------- ETH_EFRN : (ETH Offset: 0x11EC) ( R/ 32) PTP Event Frame Received Nanoseconds -------- */
#define ETH_EFRN_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_EFRN) PTP Event Frame Received Nanoseconds  Reset Value */

#define ETH_EFRN_RUD_Pos                      _UINT32_(0)                                          /* (ETH_EFRN) Register Update Position */
#define ETH_EFRN_RUD_Msk                      (_UINT32_(0x3FFFFFFF) << ETH_EFRN_RUD_Pos)           /* (ETH_EFRN) Register Update Mask */
#define ETH_EFRN_RUD(value)                   (ETH_EFRN_RUD_Msk & (_UINT32_(value) << ETH_EFRN_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFRN register */
#define ETH_EFRN_Msk                          _UINT32_(0x3FFFFFFF)                                 /* (ETH_EFRN) Register Mask  */


/* -------- ETH_EFRSH : (ETH Offset: 0x10EC) ( R/ 32) PTP Event Frame Received Seconds High Register -------- */
#define ETH_EFRSH_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_EFRSH) PTP Event Frame Received Seconds High Register  Reset Value */

#define ETH_EFRSH_RUD_Pos                     _UINT32_(0)                                          /* (ETH_EFRSH) Register Update Position */
#define ETH_EFRSH_RUD_Msk                     (_UINT32_(0xFFFF) << ETH_EFRSH_RUD_Pos)              /* (ETH_EFRSH) Register Update Mask */
#define ETH_EFRSH_RUD(value)                  (ETH_EFRSH_RUD_Msk & (_UINT32_(value) << ETH_EFRSH_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFRSH register */
#define ETH_EFRSH_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_EFRSH) Register Mask  */


/* -------- ETH_EFRSL : (ETH Offset: 0x11E8) ( R/ 32) PTP Event Frame Received Seconds Low Register -------- */
#define ETH_EFRSL_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_EFRSL) PTP Event Frame Received Seconds Low Register  Reset Value */

#define ETH_EFRSL_RUD_Pos                     _UINT32_(0)                                          /* (ETH_EFRSL) Register Update Position */
#define ETH_EFRSL_RUD_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_EFRSL_RUD_Pos)          /* (ETH_EFRSL) Register Update Mask */
#define ETH_EFRSL_RUD(value)                  (ETH_EFRSL_RUD_Msk & (_UINT32_(value) << ETH_EFRSL_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFRSL register */
#define ETH_EFRSL_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_EFRSL) Register Mask  */


/* -------- ETH_EFTN : (ETH Offset: 0x11E4) ( R/ 32) PTP Event Frame Transmitted Nanoseconds -------- */
#define ETH_EFTN_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_EFTN) PTP Event Frame Transmitted Nanoseconds  Reset Value */

#define ETH_EFTN_RUD_Pos                      _UINT32_(0)                                          /* (ETH_EFTN) Register Update Position */
#define ETH_EFTN_RUD_Msk                      (_UINT32_(0x3FFFFFFF) << ETH_EFTN_RUD_Pos)           /* (ETH_EFTN) Register Update Mask */
#define ETH_EFTN_RUD(value)                   (ETH_EFTN_RUD_Msk & (_UINT32_(value) << ETH_EFTN_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFTN register */
#define ETH_EFTN_Msk                          _UINT32_(0x3FFFFFFF)                                 /* (ETH_EFTN) Register Mask  */


/* -------- ETH_EFTSH : (ETH Offset: 0x10E8) ( R/ 32) PTP Event Frame Transmitted Seconds High Register -------- */
#define ETH_EFTSH_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_EFTSH) PTP Event Frame Transmitted Seconds High Register  Reset Value */

#define ETH_EFTSH_RUD_Pos                     _UINT32_(0)                                          /* (ETH_EFTSH) Register Update Position */
#define ETH_EFTSH_RUD_Msk                     (_UINT32_(0xFFFF) << ETH_EFTSH_RUD_Pos)              /* (ETH_EFTSH) Register Update Mask */
#define ETH_EFTSH_RUD(value)                  (ETH_EFTSH_RUD_Msk & (_UINT32_(value) << ETH_EFTSH_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFTSH register */
#define ETH_EFTSH_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_EFTSH) Register Mask  */


/* -------- ETH_EFTSL : (ETH Offset: 0x11E0) ( R/ 32) PTP Event Frame Transmitted Seconds Low Register -------- */
#define ETH_EFTSL_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_EFTSL) PTP Event Frame Transmitted Seconds Low Register  Reset Value */

#define ETH_EFTSL_RUD_Pos                     _UINT32_(0)                                          /* (ETH_EFTSL) Register Update Position */
#define ETH_EFTSL_RUD_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_EFTSL_RUD_Pos)          /* (ETH_EFTSL) Register Update Mask */
#define ETH_EFTSL_RUD(value)                  (ETH_EFTSL_RUD_Msk & (_UINT32_(value) << ETH_EFTSL_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFTSL register */
#define ETH_EFTSL_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_EFTSL) Register Mask  */


/* -------- ETH_EVCTRL : (ETH Offset: 0x0C) (R/W 32) Event Control Register -------- */
#define ETH_EVCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_EVCTRL) Event Control Register  Reset Value */

#define ETH_EVCTRL_CMPEO_Pos                  _UINT32_(0)                                          /* (ETH_EVCTRL) Compare Event Out enable Position */
#define ETH_EVCTRL_CMPEO_Msk                  (_UINT32_(0x1) << ETH_EVCTRL_CMPEO_Pos)              /* (ETH_EVCTRL) Compare Event Out enable Mask */
#define ETH_EVCTRL_CMPEO(value)               (ETH_EVCTRL_CMPEO_Msk & (_UINT32_(value) << ETH_EVCTRL_CMPEO_Pos)) /* Assigment of value for CMPEO in the ETH_EVCTRL register */
#define ETH_EVCTRL_Msk                        _UINT32_(0x00000001)                                 /* (ETH_EVCTRL) Register Mask  */


/* -------- ETH_FCSE : (ETH Offset: 0x1190) ( R/ 32) Frame Check Sequence Errors Register -------- */
#define ETH_FCSE_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_FCSE) Frame Check Sequence Errors Register  Reset Value */

#define ETH_FCSE_FCKR_Pos                     _UINT32_(0)                                          /* (ETH_FCSE) Frame Check Sequence Errors Position */
#define ETH_FCSE_FCKR_Msk                     (_UINT32_(0x3FF) << ETH_FCSE_FCKR_Pos)               /* (ETH_FCSE) Frame Check Sequence Errors Mask */
#define ETH_FCSE_FCKR(value)                  (ETH_FCSE_FCKR_Msk & (_UINT32_(value) << ETH_FCSE_FCKR_Pos)) /* Assigment of value for FCKR in the ETH_FCSE register */
#define ETH_FCSE_Msk                          _UINT32_(0x000003FF)                                 /* (ETH_FCSE) Register Mask  */


