Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
/* -------- ETH_FR : (ETH Offset: 0x1158) ( R/ 32) Frames Received Register -------- */
#define ETH_FR_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_FR) Frames Received Register  Reset Value */

#define ETH_FR_FRX_Pos                        _UINT32_(0)                                          /* (ETH_FR) Frames Received without Error Position */
#define ETH_FR_FRX_Msk                        (_UINT32_(0xFFFFFFFF) << ETH_FR_FRX_Pos)             /* (ETH_FR) Frames Received without Error Mask */
#define ETH_FR_FRX(value)                     (ETH_FR_FRX_Msk & (_UINT32_(value) << ETH_FR_FRX_Pos)) /* Assigment of value for FRX in the ETH_FR register */
#define ETH_FR_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (ETH_FR) Register Mask  */


/* -------- ETH_FT : (ETH Offset: 0x1108) ( R/ 32) Frames Transmitted Register -------- */
#define ETH_FT_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_FT) Frames Transmitted Register  Reset Value */

#define ETH_FT_FTX_Pos                        _UINT32_(0)                                          /* (ETH_FT) Frames Transmitted without Error Position */
#define ETH_FT_FTX_Msk                        (_UINT32_(0xFFFFFFFF) << ETH_FT_FTX_Pos)             /* (ETH_FT) Frames Transmitted without Error Mask */
#define ETH_FT_FTX(value)                     (ETH_FT_FTX_Msk & (_UINT32_(value) << ETH_FT_FTX_Pos)) /* Assigment of value for FTX in the ETH_FT register */
#define ETH_FT_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (ETH_FT) Register Mask  */


/* -------- ETH_GTBFT1518 : (ETH Offset: 0x1130) ( R/ 32) Greater Than 1518 Byte Frames Transmitted Register -------- */
#define ETH_GTBFT1518_RESETVALUE              _UINT32_(0x00)                                       /*  (ETH_GTBFT1518) Greater Than 1518 Byte Frames Transmitted Register  Reset Value */

#define ETH_GTBFT1518_NFTX_Pos                _UINT32_(0)                                          /* (ETH_GTBFT1518) Greater than 1518 Byte Frames Transmitted without Error Position */
#define ETH_GTBFT1518_NFTX_Msk                (_UINT32_(0xFFFFFFFF) << ETH_GTBFT1518_NFTX_Pos)     /* (ETH_GTBFT1518) Greater than 1518 Byte Frames Transmitted without Error Mask */
#define ETH_GTBFT1518_NFTX(value)             (ETH_GTBFT1518_NFTX_Msk & (_UINT32_(value) << ETH_GTBFT1518_NFTX_Pos)) /* Assigment of value for NFTX in the ETH_GTBFT1518 register */
#define ETH_GTBFT1518_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ETH_GTBFT1518) Register Mask  */


/* -------- ETH_HRB : (ETH Offset: 0x1080) (R/W 32) Hash Register Bottom [31:0] -------- */
#define ETH_HRB_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_HRB) Hash Register Bottom [31:0]  Reset Value */

#define ETH_HRB_ADDR_Pos                      _UINT32_(0)                                          /* (ETH_HRB) Hash Address Position */
#define ETH_HRB_ADDR_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_HRB_ADDR_Pos)           /* (ETH_HRB) Hash Address Mask */
#define ETH_HRB_ADDR(value)                   (ETH_HRB_ADDR_Msk & (_UINT32_(value) << ETH_HRB_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_HRB register */
#define ETH_HRB_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_HRB) Register Mask  */


/* -------- ETH_HRT : (ETH Offset: 0x1084) (R/W 32) Hash Register Top [63:32] -------- */
#define ETH_HRT_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_HRT) Hash Register Top [63:32]  Reset Value */

#define ETH_HRT_ADDR_Pos                      _UINT32_(0)                                          /* (ETH_HRT) Hash Address Position */
#define ETH_HRT_ADDR_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_HRT_ADDR_Pos)           /* (ETH_HRT) Hash Address Mask */
#define ETH_HRT_ADDR(value)                   (ETH_HRT_ADDR_Msk & (_UINT32_(value) << ETH_HRT_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_HRT register */
#define ETH_HRT_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_HRT) Register Mask  */


/* -------- ETH_IDR : (ETH Offset: 0x102C) ( /W 32) Interrupt Disable Register -------- */
#define ETH_IDR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_IDR) Interrupt Disable Register  Reset Value */

#define ETH_IDR_MFS_Pos                       _UINT32_(0)                                          /* (ETH_IDR) Management Frame Sent Position */
#define ETH_IDR_MFS_Msk                       (_UINT32_(0x1) << ETH_IDR_MFS_Pos)                   /* (ETH_IDR) Management Frame Sent Mask */
#define ETH_IDR_MFS(value)                    (ETH_IDR_MFS_Msk & (_UINT32_(value) << ETH_IDR_MFS_Pos)) /* Assigment of value for MFS in the ETH_IDR register */
#define ETH_IDR_RCOMP_Pos                     _UINT32_(1)                                          /* (ETH_IDR) Receive Complete Position */
#define ETH_IDR_RCOMP_Msk                     (_UINT32_(0x1) << ETH_IDR_RCOMP_Pos)                 /* (ETH_IDR) Receive Complete Mask */
#define ETH_IDR_RCOMP(value)                  (ETH_IDR_RCOMP_Msk & (_UINT32_(value) << ETH_IDR_RCOMP_Pos)) /* Assigment of value for RCOMP in the ETH_IDR register */
#define ETH_IDR_RXUBR_Pos                     _UINT32_(2)                                          /* (ETH_IDR) RX Used Bit Read Position */
#define ETH_IDR_RXUBR_Msk                     (_UINT32_(0x1) << ETH_IDR_RXUBR_Pos)                 /* (ETH_IDR) RX Used Bit Read Mask */
#define ETH_IDR_RXUBR(value)                  (ETH_IDR_RXUBR_Msk & (_UINT32_(value) << ETH_IDR_RXUBR_Pos)) /* Assigment of value for RXUBR in the ETH_IDR register */
#define ETH_IDR_TXUBR_Pos                     _UINT32_(3)                                          /* (ETH_IDR) TX Used Bit Read Position */
#define ETH_IDR_TXUBR_Msk                     (_UINT32_(0x1) << ETH_IDR_TXUBR_Pos)                 /* (ETH_IDR) TX Used Bit Read Mask */
#define ETH_IDR_TXUBR(value)                  (ETH_IDR_TXUBR_Msk & (_UINT32_(value) << ETH_IDR_TXUBR_Pos)) /* Assigment of value for TXUBR in the ETH_IDR register */
#define ETH_IDR_TUR_Pos                       _UINT32_(4)                                          /* (ETH_IDR) Transmit Underrun Position */
#define ETH_IDR_TUR_Msk                       (_UINT32_(0x1) << ETH_IDR_TUR_Pos)                   /* (ETH_IDR) Transmit Underrun Mask */
#define ETH_IDR_TUR(value)                    (ETH_IDR_TUR_Msk & (_UINT32_(value) << ETH_IDR_TUR_Pos)) /* Assigment of value for TUR in the ETH_IDR register */
#define ETH_IDR_RLEX_Pos                      _UINT32_(5)                                          /* (ETH_IDR) Retry Limit Exceeded or Late Collision Position */
#define ETH_IDR_RLEX_Msk                      (_UINT32_(0x1) << ETH_IDR_RLEX_Pos)                  /* (ETH_IDR) Retry Limit Exceeded or Late Collision Mask */
#define ETH_IDR_RLEX(value)                   (ETH_IDR_RLEX_Msk & (_UINT32_(value) << ETH_IDR_RLEX_Pos)) /* Assigment of value for RLEX in the ETH_IDR register */
#define ETH_IDR_TFC_Pos                       _UINT32_(6)                                          /* (ETH_IDR) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_IDR_TFC_Msk                       (_UINT32_(0x1) << ETH_IDR_TFC_Pos)                   /* (ETH_IDR) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_IDR_TFC(value)                    (ETH_IDR_TFC_Msk & (_UINT32_(value) << ETH_IDR_TFC_Pos)) /* Assigment of value for TFC in the ETH_IDR register */
#define ETH_IDR_TCOMP_Pos                     _UINT32_(7)                                          /* (ETH_IDR) Transmit Complete Position */
#define ETH_IDR_TCOMP_Msk                     (_UINT32_(0x1) << ETH_IDR_TCOMP_Pos)                 /* (ETH_IDR) Transmit Complete Mask */
#define ETH_IDR_TCOMP(value)                  (ETH_IDR_TCOMP_Msk & (_UINT32_(value) << ETH_IDR_TCOMP_Pos)) /* Assigment of value for TCOMP in the ETH_IDR register */
#define ETH_IDR_ROVR_Pos                      _UINT32_(10)                                         /* (ETH_IDR) Receive Overrun Position */
#define ETH_IDR_ROVR_Msk                      (_UINT32_(0x1) << ETH_IDR_ROVR_Pos)                  /* (ETH_IDR) Receive Overrun Mask */
#define ETH_IDR_ROVR(value)                   (ETH_IDR_ROVR_Msk & (_UINT32_(value) << ETH_IDR_ROVR_Pos)) /* Assigment of value for ROVR in the ETH_IDR register */
#define ETH_IDR_HRESP_Pos                     _UINT32_(11)                                         /* (ETH_IDR) HRESP Not OK Position */
#define ETH_IDR_HRESP_Msk                     (_UINT32_(0x1) << ETH_IDR_HRESP_Pos)                 /* (ETH_IDR) HRESP Not OK Mask */
#define ETH_IDR_HRESP(value)                  (ETH_IDR_HRESP_Msk & (_UINT32_(value) << ETH_IDR_HRESP_Pos)) /* Assigment of value for HRESP in the ETH_IDR register */
#define ETH_IDR_PFNZ_Pos                      _UINT32_(12)                                         /* (ETH_IDR) Pause Frame with Non-zero Pause Quantum Received Position */
#define ETH_IDR_PFNZ_Msk                      (_UINT32_(0x1) << ETH_IDR_PFNZ_Pos)                  /* (ETH_IDR) Pause Frame with Non-zero Pause Quantum Received Mask */
#define ETH_IDR_PFNZ(value)                   (ETH_IDR_PFNZ_Msk & (_UINT32_(value) << ETH_IDR_PFNZ_Pos)) /* Assigment of value for PFNZ in the ETH_IDR register */
#define ETH_IDR_PTZ_Pos                       _UINT32_(13)                                         /* (ETH_IDR) Pause Time Zero Position */
#define ETH_IDR_PTZ_Msk                       (_UINT32_(0x1) << ETH_IDR_PTZ_Pos)                   /* (ETH_IDR) Pause Time Zero Mask */
#define ETH_IDR_PTZ(value)                    (ETH_IDR_PTZ_Msk & (_UINT32_(value) << ETH_IDR_PTZ_Pos)) /* Assigment of value for PTZ in the ETH_IDR register */
#define ETH_IDR_PFTR_Pos                      _UINT32_(14)                                         /* (ETH_IDR) Pause Frame Transmitted Position */
#define ETH_IDR_PFTR_Msk                      (_UINT32_(0x1) << ETH_IDR_PFTR_Pos)                  /* (ETH_IDR) Pause Frame Transmitted Mask */
#define ETH_IDR_PFTR(value)                   (ETH_IDR_PFTR_Msk & (_UINT32_(value) << ETH_IDR_PFTR_Pos)) /* Assigment of value for PFTR in the ETH_IDR register */
#define ETH_IDR_EXINT_Pos                     _UINT32_(15)                                         /* (ETH_IDR) External Interrupt Position */
#define ETH_IDR_EXINT_Msk                     (_UINT32_(0x1) << ETH_IDR_EXINT_Pos)                 /* (ETH_IDR) External Interrupt Mask */
#define ETH_IDR_EXINT(value)                  (ETH_IDR_EXINT_Msk & (_UINT32_(value) << ETH_IDR_EXINT_Pos)) /* Assigment of value for EXINT in the ETH_IDR register */
#define ETH_IDR_DRQFR_Pos                     _UINT32_(18)                                         /* (ETH_IDR) PTP Delay Request Frame Received Position */
#define ETH_IDR_DRQFR_Msk                     (_UINT32_(0x1) << ETH_IDR_DRQFR_Pos)                 /* (ETH_IDR) PTP Delay Request Frame Received Mask */
#define ETH_IDR_DRQFR(value)                  (ETH_IDR_DRQFR_Msk & (_UINT32_(value) << ETH_IDR_DRQFR_Pos)) /* Assigment of value for DRQFR in the ETH_IDR register */
#define ETH_IDR_SFR_Pos                       _UINT32_(19)                                         /* (ETH_IDR) PTP Sync Frame Received Position */
#define ETH_IDR_SFR_Msk                       (_UINT32_(0x1) << ETH_IDR_SFR_Pos)                   /* (ETH_IDR) PTP Sync Frame Received Mask */
#define ETH_IDR_SFR(value)                    (ETH_IDR_SFR_Msk & (_UINT32_(value) << ETH_IDR_SFR_Pos)) /* Assigment of value for SFR in the ETH_IDR register */
#define ETH_IDR_DRQFT_Pos                     _UINT32_(20)                                         /* (ETH_IDR) PTP Delay Request Frame Transmitted Position */
#define ETH_IDR_DRQFT_Msk                     (_UINT32_(0x1) << ETH_IDR_DRQFT_Pos)                 /* (ETH_IDR) PTP Delay Request Frame Transmitted Mask */
#define ETH_IDR_DRQFT(value)                  (ETH_IDR_DRQFT_Msk & (_UINT32_(value) << ETH_IDR_DRQFT_Pos)) /* Assigment of value for DRQFT in the ETH_IDR register */
#define ETH_IDR_SFT_Pos                       _UINT32_(21)                                         /* (ETH_IDR) PTP Sync Frame Transmitted Position */
#define ETH_IDR_SFT_Msk                       (_UINT32_(0x1) << ETH_IDR_SFT_Pos)                   /* (ETH_IDR) PTP Sync Frame Transmitted Mask */
#define ETH_IDR_SFT(value)                    (ETH_IDR_SFT_Msk & (_UINT32_(value) << ETH_IDR_SFT_Pos)) /* Assigment of value for SFT in the ETH_IDR register */
#define ETH_IDR_PDRQFR_Pos                    _UINT32_(22)                                         /* (ETH_IDR) PDelay Request Frame Received Position */
#define ETH_IDR_PDRQFR_Msk                    (_UINT32_(0x1) << ETH_IDR_PDRQFR_Pos)                /* (ETH_IDR) PDelay Request Frame Received Mask */
#define ETH_IDR_PDRQFR(value)                 (ETH_IDR_PDRQFR_Msk & (_UINT32_(value) << ETH_IDR_PDRQFR_Pos)) /* Assigment of value for PDRQFR in the ETH_IDR register */
#define ETH_IDR_PDRSFR_Pos                    _UINT32_(23)                                         /* (ETH_IDR) PDelay Response Frame Received Position */
#define ETH_IDR_PDRSFR_Msk                    (_UINT32_(0x1) << ETH_IDR_PDRSFR_Pos)                /* (ETH_IDR) PDelay Response Frame Received Mask */
#define ETH_IDR_PDRSFR(value)                 (ETH_IDR_PDRSFR_Msk & (_UINT32_(value) << ETH_IDR_PDRSFR_Pos)) /* Assigment of value for PDRSFR in the ETH_IDR register */
#define ETH_IDR_PDRQFT_Pos                    _UINT32_(24)                                         /* (ETH_IDR) PDelay Request Frame Transmitted Position */
#define ETH_IDR_PDRQFT_Msk                    (_UINT32_(0x1) << ETH_IDR_PDRQFT_Pos)                /* (ETH_IDR) PDelay Request Frame Transmitted Mask */
#define ETH_IDR_PDRQFT(value)                 (ETH_IDR_PDRQFT_Msk & (_UINT32_(value) << ETH_IDR_PDRQFT_Pos)) /* Assigment of value for PDRQFT in the ETH_IDR register */
#define ETH_IDR_PDRSFT_Pos                    _UINT32_(25)                                         /* (ETH_IDR) PDelay Response Frame Transmitted Position */
#define ETH_IDR_PDRSFT_Msk                    (_UINT32_(0x1) << ETH_IDR_PDRSFT_Pos)                /* (ETH_IDR) PDelay Response Frame Transmitted Mask */
#define ETH_IDR_PDRSFT(value)                 (ETH_IDR_PDRSFT_Msk & (_UINT32_(value) << ETH_IDR_PDRSFT_Pos)) /* Assigment of value for PDRSFT in the ETH_IDR register */
#define ETH_IDR_SRI_Pos                       _UINT32_(26)                                         /* (ETH_IDR) TSU Seconds Register Increment Position */
#define ETH_IDR_SRI_Msk                       (_UINT32_(0x1) << ETH_IDR_SRI_Pos)                   /* (ETH_IDR) TSU Seconds Register Increment Mask */
#define ETH_IDR_SRI(value)                    (ETH_IDR_SRI_Msk & (_UINT32_(value) << ETH_IDR_SRI_Pos)) /* Assigment of value for SRI in the ETH_IDR register */
#define ETH_IDR_WOL_Pos                       _UINT32_(28)                                         /* (ETH_IDR) Wake On LAN Position */
#define ETH_IDR_WOL_Msk                       (_UINT32_(0x1) << ETH_IDR_WOL_Pos)                   /* (ETH_IDR) Wake On LAN Mask */
#define ETH_IDR_WOL(value)                    (ETH_IDR_WOL_Msk & (_UINT32_(value) << ETH_IDR_WOL_Pos)) /* Assigment of value for WOL in the ETH_IDR register */
#define ETH_IDR_TSUCMP_Pos                    _UINT32_(29)                                         /* (ETH_IDR) Tsu timer comparison Position */
#define ETH_IDR_TSUCMP_Msk                    (_UINT32_(0x1) << ETH_IDR_TSUCMP_Pos)                /* (ETH_IDR) Tsu timer comparison Mask */
#define ETH_IDR_TSUCMP(value)                 (ETH_IDR_TSUCMP_Msk & (_UINT32_(value) << ETH_IDR_TSUCMP_Pos)) /* Assigment of value for TSUCMP in the ETH_IDR register */
#define ETH_IDR_Msk                           _UINT32_(0x37FCFCFF)                                 /* (ETH_IDR) Register Mask  */


/* -------- ETH_IER : (ETH Offset: 0x1028) ( /W 32) Interrupt Enable Register -------- */
#define ETH_IER_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_IER) Interrupt Enable Register  Reset Value */

