Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
/* -------- ETH_IPGS : (ETH Offset: 0x10BC) (R/W 32) IPG Stretch Register -------- */
#define ETH_IPGS_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_IPGS) IPG Stretch Register  Reset Value */

#define ETH_IPGS_FL_Pos                       _UINT32_(0)                                          /* (ETH_IPGS) Frame Length Position */
#define ETH_IPGS_FL_Msk                       (_UINT32_(0xFFFF) << ETH_IPGS_FL_Pos)                /* (ETH_IPGS) Frame Length Mask */
#define ETH_IPGS_FL(value)                    (ETH_IPGS_FL_Msk & (_UINT32_(value) << ETH_IPGS_FL_Pos)) /* Assigment of value for FL in the ETH_IPGS register */
#define ETH_IPGS_Msk                          _UINT32_(0x0000FFFF)                                 /* (ETH_IPGS) Register Mask  */


/* -------- ETH_ISR : (ETH Offset: 0x1024) (R/W 32) Interrupt Status Register -------- */
#define ETH_ISR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_ISR) Interrupt Status Register  Reset Value */

#define ETH_ISR_MFS_Pos                       _UINT32_(0)                                          /* (ETH_ISR) Management Frame Sent Position */
#define ETH_ISR_MFS_Msk                       (_UINT32_(0x1) << ETH_ISR_MFS_Pos)                   /* (ETH_ISR) Management Frame Sent Mask */
#define ETH_ISR_MFS(value)                    (ETH_ISR_MFS_Msk & (_UINT32_(value) << ETH_ISR_MFS_Pos)) /* Assigment of value for MFS in the ETH_ISR register */
#define ETH_ISR_RCOMP_Pos                     _UINT32_(1)                                          /* (ETH_ISR) Receive Complete Position */
#define ETH_ISR_RCOMP_Msk                     (_UINT32_(0x1) << ETH_ISR_RCOMP_Pos)                 /* (ETH_ISR) Receive Complete Mask */
#define ETH_ISR_RCOMP(value)                  (ETH_ISR_RCOMP_Msk & (_UINT32_(value) << ETH_ISR_RCOMP_Pos)) /* Assigment of value for RCOMP in the ETH_ISR register */
#define ETH_ISR_RXUBR_Pos                     _UINT32_(2)                                          /* (ETH_ISR) RX Used Bit Read Position */
#define ETH_ISR_RXUBR_Msk                     (_UINT32_(0x1) << ETH_ISR_RXUBR_Pos)                 /* (ETH_ISR) RX Used Bit Read Mask */
#define ETH_ISR_RXUBR(value)                  (ETH_ISR_RXUBR_Msk & (_UINT32_(value) << ETH_ISR_RXUBR_Pos)) /* Assigment of value for RXUBR in the ETH_ISR register */
#define ETH_ISR_TXUBR_Pos                     _UINT32_(3)                                          /* (ETH_ISR) TX Used Bit Read Position */
#define ETH_ISR_TXUBR_Msk                     (_UINT32_(0x1) << ETH_ISR_TXUBR_Pos)                 /* (ETH_ISR) TX Used Bit Read Mask */
#define ETH_ISR_TXUBR(value)                  (ETH_ISR_TXUBR_Msk & (_UINT32_(value) << ETH_ISR_TXUBR_Pos)) /* Assigment of value for TXUBR in the ETH_ISR register */
#define ETH_ISR_TUR_Pos                       _UINT32_(4)                                          /* (ETH_ISR) Transmit Underrun Position */
#define ETH_ISR_TUR_Msk                       (_UINT32_(0x1) << ETH_ISR_TUR_Pos)                   /* (ETH_ISR) Transmit Underrun Mask */
#define ETH_ISR_TUR(value)                    (ETH_ISR_TUR_Msk & (_UINT32_(value) << ETH_ISR_TUR_Pos)) /* Assigment of value for TUR in the ETH_ISR register */
#define ETH_ISR_RLEX_Pos                      _UINT32_(5)                                          /* (ETH_ISR) Retry Limit Exceeded Position */
#define ETH_ISR_RLEX_Msk                      (_UINT32_(0x1) << ETH_ISR_RLEX_Pos)                  /* (ETH_ISR) Retry Limit Exceeded Mask */
#define ETH_ISR_RLEX(value)                   (ETH_ISR_RLEX_Msk & (_UINT32_(value) << ETH_ISR_RLEX_Pos)) /* Assigment of value for RLEX in the ETH_ISR register */
#define ETH_ISR_TFC_Pos                       _UINT32_(6)                                          /* (ETH_ISR) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_ISR_TFC_Msk                       (_UINT32_(0x1) << ETH_ISR_TFC_Pos)                   /* (ETH_ISR) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_ISR_TFC(value)                    (ETH_ISR_TFC_Msk & (_UINT32_(value) << ETH_ISR_TFC_Pos)) /* Assigment of value for TFC in the ETH_ISR register */
#define ETH_ISR_TCOMP_Pos                     _UINT32_(7)                                          /* (ETH_ISR) Transmit Complete Position */
#define ETH_ISR_TCOMP_Msk                     (_UINT32_(0x1) << ETH_ISR_TCOMP_Pos)                 /* (ETH_ISR) Transmit Complete Mask */
#define ETH_ISR_TCOMP(value)                  (ETH_ISR_TCOMP_Msk & (_UINT32_(value) << ETH_ISR_TCOMP_Pos)) /* Assigment of value for TCOMP in the ETH_ISR register */
#define ETH_ISR_ROVR_Pos                      _UINT32_(10)                                         /* (ETH_ISR) Receive Overrun Position */
#define ETH_ISR_ROVR_Msk                      (_UINT32_(0x1) << ETH_ISR_ROVR_Pos)                  /* (ETH_ISR) Receive Overrun Mask */
#define ETH_ISR_ROVR(value)                   (ETH_ISR_ROVR_Msk & (_UINT32_(value) << ETH_ISR_ROVR_Pos)) /* Assigment of value for ROVR in the ETH_ISR register */
#define ETH_ISR_HRESP_Pos                     _UINT32_(11)                                         /* (ETH_ISR) HRESP Not OK Position */
#define ETH_ISR_HRESP_Msk                     (_UINT32_(0x1) << ETH_ISR_HRESP_Pos)                 /* (ETH_ISR) HRESP Not OK Mask */
#define ETH_ISR_HRESP(value)                  (ETH_ISR_HRESP_Msk & (_UINT32_(value) << ETH_ISR_HRESP_Pos)) /* Assigment of value for HRESP in the ETH_ISR register */
#define ETH_ISR_PFNZ_Pos                      _UINT32_(12)                                         /* (ETH_ISR) Pause Frame with Non-zero Pause Quantum Received Position */
#define ETH_ISR_PFNZ_Msk                      (_UINT32_(0x1) << ETH_ISR_PFNZ_Pos)                  /* (ETH_ISR) Pause Frame with Non-zero Pause Quantum Received Mask */
#define ETH_ISR_PFNZ(value)                   (ETH_ISR_PFNZ_Msk & (_UINT32_(value) << ETH_ISR_PFNZ_Pos)) /* Assigment of value for PFNZ in the ETH_ISR register */
#define ETH_ISR_PTZ_Pos                       _UINT32_(13)                                         /* (ETH_ISR) Pause Time Zero Position */
#define ETH_ISR_PTZ_Msk                       (_UINT32_(0x1) << ETH_ISR_PTZ_Pos)                   /* (ETH_ISR) Pause Time Zero Mask */
#define ETH_ISR_PTZ(value)                    (ETH_ISR_PTZ_Msk & (_UINT32_(value) << ETH_ISR_PTZ_Pos)) /* Assigment of value for PTZ in the ETH_ISR register */
#define ETH_ISR_PFTR_Pos                      _UINT32_(14)                                         /* (ETH_ISR) Pause Frame Transmitted Position */
#define ETH_ISR_PFTR_Msk                      (_UINT32_(0x1) << ETH_ISR_PFTR_Pos)                  /* (ETH_ISR) Pause Frame Transmitted Mask */
#define ETH_ISR_PFTR(value)                   (ETH_ISR_PFTR_Msk & (_UINT32_(value) << ETH_ISR_PFTR_Pos)) /* Assigment of value for PFTR in the ETH_ISR register */
#define ETH_ISR_DRQFR_Pos                     _UINT32_(18)                                         /* (ETH_ISR) PTP Delay Request Frame Received Position */
#define ETH_ISR_DRQFR_Msk                     (_UINT32_(0x1) << ETH_ISR_DRQFR_Pos)                 /* (ETH_ISR) PTP Delay Request Frame Received Mask */
#define ETH_ISR_DRQFR(value)                  (ETH_ISR_DRQFR_Msk & (_UINT32_(value) << ETH_ISR_DRQFR_Pos)) /* Assigment of value for DRQFR in the ETH_ISR register */
#define ETH_ISR_SFR_Pos                       _UINT32_(19)                                         /* (ETH_ISR) PTP Sync Frame Received Position */
#define ETH_ISR_SFR_Msk                       (_UINT32_(0x1) << ETH_ISR_SFR_Pos)                   /* (ETH_ISR) PTP Sync Frame Received Mask */
#define ETH_ISR_SFR(value)                    (ETH_ISR_SFR_Msk & (_UINT32_(value) << ETH_ISR_SFR_Pos)) /* Assigment of value for SFR in the ETH_ISR register */
#define ETH_ISR_DRQFT_Pos                     _UINT32_(20)                                         /* (ETH_ISR) PTP Delay Request Frame Transmitted Position */
#define ETH_ISR_DRQFT_Msk                     (_UINT32_(0x1) << ETH_ISR_DRQFT_Pos)                 /* (ETH_ISR) PTP Delay Request Frame Transmitted Mask */
#define ETH_ISR_DRQFT(value)                  (ETH_ISR_DRQFT_Msk & (_UINT32_(value) << ETH_ISR_DRQFT_Pos)) /* Assigment of value for DRQFT in the ETH_ISR register */
#define ETH_ISR_SFT_Pos                       _UINT32_(21)                                         /* (ETH_ISR) PTP Sync Frame Transmitted Position */
#define ETH_ISR_SFT_Msk                       (_UINT32_(0x1) << ETH_ISR_SFT_Pos)                   /* (ETH_ISR) PTP Sync Frame Transmitted Mask */
#define ETH_ISR_SFT(value)                    (ETH_ISR_SFT_Msk & (_UINT32_(value) << ETH_ISR_SFT_Pos)) /* Assigment of value for SFT in the ETH_ISR register */
#define ETH_ISR_PDRQFR_Pos                    _UINT32_(22)                                         /* (ETH_ISR) PDelay Request Frame Received Position */
#define ETH_ISR_PDRQFR_Msk                    (_UINT32_(0x1) << ETH_ISR_PDRQFR_Pos)                /* (ETH_ISR) PDelay Request Frame Received Mask */
#define ETH_ISR_PDRQFR(value)                 (ETH_ISR_PDRQFR_Msk & (_UINT32_(value) << ETH_ISR_PDRQFR_Pos)) /* Assigment of value for PDRQFR in the ETH_ISR register */
#define ETH_ISR_PDRSFR_Pos                    _UINT32_(23)                                         /* (ETH_ISR) PDelay Response Frame Received Position */
#define ETH_ISR_PDRSFR_Msk                    (_UINT32_(0x1) << ETH_ISR_PDRSFR_Pos)                /* (ETH_ISR) PDelay Response Frame Received Mask */
#define ETH_ISR_PDRSFR(value)                 (ETH_ISR_PDRSFR_Msk & (_UINT32_(value) << ETH_ISR_PDRSFR_Pos)) /* Assigment of value for PDRSFR in the ETH_ISR register */
#define ETH_ISR_PDRQFT_Pos                    _UINT32_(24)                                         /* (ETH_ISR) PDelay Request Frame Transmitted Position */
#define ETH_ISR_PDRQFT_Msk                    (_UINT32_(0x1) << ETH_ISR_PDRQFT_Pos)                /* (ETH_ISR) PDelay Request Frame Transmitted Mask */
#define ETH_ISR_PDRQFT(value)                 (ETH_ISR_PDRQFT_Msk & (_UINT32_(value) << ETH_ISR_PDRQFT_Pos)) /* Assigment of value for PDRQFT in the ETH_ISR register */
#define ETH_ISR_PDRSFT_Pos                    _UINT32_(25)                                         /* (ETH_ISR) PDelay Response Frame Transmitted Position */
#define ETH_ISR_PDRSFT_Msk                    (_UINT32_(0x1) << ETH_ISR_PDRSFT_Pos)                /* (ETH_ISR) PDelay Response Frame Transmitted Mask */
#define ETH_ISR_PDRSFT(value)                 (ETH_ISR_PDRSFT_Msk & (_UINT32_(value) << ETH_ISR_PDRSFT_Pos)) /* Assigment of value for PDRSFT in the ETH_ISR register */
#define ETH_ISR_SRI_Pos                       _UINT32_(26)                                         /* (ETH_ISR) TSU Seconds Register Increment Position */
#define ETH_ISR_SRI_Msk                       (_UINT32_(0x1) << ETH_ISR_SRI_Pos)                   /* (ETH_ISR) TSU Seconds Register Increment Mask */
#define ETH_ISR_SRI(value)                    (ETH_ISR_SRI_Msk & (_UINT32_(value) << ETH_ISR_SRI_Pos)) /* Assigment of value for SRI in the ETH_ISR register */
#define ETH_ISR_WOL_Pos                       _UINT32_(28)                                         /* (ETH_ISR) Wake On LAN Position */
#define ETH_ISR_WOL_Msk                       (_UINT32_(0x1) << ETH_ISR_WOL_Pos)                   /* (ETH_ISR) Wake On LAN Mask */
#define ETH_ISR_WOL(value)                    (ETH_ISR_WOL_Msk & (_UINT32_(value) << ETH_ISR_WOL_Pos)) /* Assigment of value for WOL in the ETH_ISR register */
#define ETH_ISR_TSUCMP_Pos                    _UINT32_(29)                                         /* (ETH_ISR) Tsu timer comparison Position */
#define ETH_ISR_TSUCMP_Msk                    (_UINT32_(0x1) << ETH_ISR_TSUCMP_Pos)                /* (ETH_ISR) Tsu timer comparison Mask */
#define ETH_ISR_TSUCMP(value)                 (ETH_ISR_TSUCMP_Msk & (_UINT32_(value) << ETH_ISR_TSUCMP_Pos)) /* Assigment of value for TSUCMP in the ETH_ISR register */
#define ETH_ISR_Msk                           _UINT32_(0x37FC7CFF)                                 /* (ETH_ISR) Register Mask  */


