Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
/* -------- ETH_JR : (ETH Offset: 0x118C) ( R/ 32) Jabbers Received Register -------- */
#define ETH_JR_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_JR) Jabbers Received Register  Reset Value */

#define ETH_JR_JRX_Pos                        _UINT32_(0)                                          /* (ETH_JR) Jabbers Received Position */
#define ETH_JR_JRX_Msk                        (_UINT32_(0x3FF) << ETH_JR_JRX_Pos)                  /* (ETH_JR) Jabbers Received Mask */
#define ETH_JR_JRX(value)                     (ETH_JR_JRX_Msk & (_UINT32_(value) << ETH_JR_JRX_Pos)) /* Assigment of value for JRX in the ETH_JR register */
#define ETH_JR_Msk                            _UINT32_(0x000003FF)                                 /* (ETH_JR) Register Mask  */


/* -------- ETH_LC : (ETH Offset: 0x1144) ( R/ 32) Late Collisions Register -------- */
#define ETH_LC_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_LC) Late Collisions Register  Reset Value */

#define ETH_LC_LCOL_Pos                       _UINT32_(0)                                          /* (ETH_LC) Late Collisions Position */
#define ETH_LC_LCOL_Msk                       (_UINT32_(0x3FF) << ETH_LC_LCOL_Pos)                 /* (ETH_LC) Late Collisions Mask */
#define ETH_LC_LCOL(value)                    (ETH_LC_LCOL_Msk & (_UINT32_(value) << ETH_LC_LCOL_Pos)) /* Assigment of value for LCOL in the ETH_LC register */
#define ETH_LC_Msk                            _UINT32_(0x000003FF)                                 /* (ETH_LC) Register Mask  */


/* -------- ETH_LFFE : (ETH Offset: 0x1194) ( R/ 32) Length Field Frame Errors Register -------- */
#define ETH_LFFE_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_LFFE) Length Field Frame Errors Register  Reset Value */

#define ETH_LFFE_LFER_Pos                     _UINT32_(0)                                          /* (ETH_LFFE) Length Field Frame Errors Position */
#define ETH_LFFE_LFER_Msk                     (_UINT32_(0x3FF) << ETH_LFFE_LFER_Pos)               /* (ETH_LFFE) Length Field Frame Errors Mask */
#define ETH_LFFE_LFER(value)                  (ETH_LFFE_LFER_Msk & (_UINT32_(value) << ETH_LFFE_LFER_Pos)) /* Assigment of value for LFER in the ETH_LFFE register */
#define ETH_LFFE_Msk                          _UINT32_(0x000003FF)                                 /* (ETH_LFFE) Register Mask  */


/* -------- ETH_MAN : (ETH Offset: 0x1034) (R/W 32) PHY Maintenance Register -------- */
#define ETH_MAN_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_MAN) PHY Maintenance Register  Reset Value */

#define ETH_MAN_DATA_Pos                      _UINT32_(0)                                          /* (ETH_MAN) PHY Data Position */
#define ETH_MAN_DATA_Msk                      (_UINT32_(0xFFFF) << ETH_MAN_DATA_Pos)               /* (ETH_MAN) PHY Data Mask */
#define ETH_MAN_DATA(value)                   (ETH_MAN_DATA_Msk & (_UINT32_(value) << ETH_MAN_DATA_Pos)) /* Assigment of value for DATA in the ETH_MAN register */
#define ETH_MAN_WTN_Pos                       _UINT32_(16)                                         /* (ETH_MAN) Write Ten Position */
#define ETH_MAN_WTN_Msk                       (_UINT32_(0x3) << ETH_MAN_WTN_Pos)                   /* (ETH_MAN) Write Ten Mask */
#define ETH_MAN_WTN(value)                    (ETH_MAN_WTN_Msk & (_UINT32_(value) << ETH_MAN_WTN_Pos)) /* Assigment of value for WTN in the ETH_MAN register */
#define ETH_MAN_REGA_Pos                      _UINT32_(18)                                         /* (ETH_MAN) Register Address Position */
#define ETH_MAN_REGA_Msk                      (_UINT32_(0x1F) << ETH_MAN_REGA_Pos)                 /* (ETH_MAN) Register Address Mask */
#define ETH_MAN_REGA(value)                   (ETH_MAN_REGA_Msk & (_UINT32_(value) << ETH_MAN_REGA_Pos)) /* Assigment of value for REGA in the ETH_MAN register */
#define ETH_MAN_PHYA_Pos                      _UINT32_(23)                                         /* (ETH_MAN) PHY Address Position */
#define ETH_MAN_PHYA_Msk                      (_UINT32_(0x1F) << ETH_MAN_PHYA_Pos)                 /* (ETH_MAN) PHY Address Mask */
#define ETH_MAN_PHYA(value)                   (ETH_MAN_PHYA_Msk & (_UINT32_(value) << ETH_MAN_PHYA_Pos)) /* Assigment of value for PHYA in the ETH_MAN register */
#define ETH_MAN_OP_Pos                        _UINT32_(28)                                         /* (ETH_MAN) Operation Position */
#define ETH_MAN_OP_Msk                        (_UINT32_(0x3) << ETH_MAN_OP_Pos)                    /* (ETH_MAN) Operation Mask */
#define ETH_MAN_OP(value)                     (ETH_MAN_OP_Msk & (_UINT32_(value) << ETH_MAN_OP_Pos)) /* Assigment of value for OP in the ETH_MAN register */
#define ETH_MAN_CLTTO_Pos                     _UINT32_(30)                                         /* (ETH_MAN) Clause 22 Operation Position */
#define ETH_MAN_CLTTO_Msk                     (_UINT32_(0x1) << ETH_MAN_CLTTO_Pos)                 /* (ETH_MAN) Clause 22 Operation Mask */
#define ETH_MAN_CLTTO(value)                  (ETH_MAN_CLTTO_Msk & (_UINT32_(value) << ETH_MAN_CLTTO_Pos)) /* Assigment of value for CLTTO in the ETH_MAN register */
#define ETH_MAN_WZO_Pos                       _UINT32_(31)                                         /* (ETH_MAN) Write ZERO Position */
#define ETH_MAN_WZO_Msk                       (_UINT32_(0x1) << ETH_MAN_WZO_Pos)                   /* (ETH_MAN) Write ZERO Mask */
#define ETH_MAN_WZO(value)                    (ETH_MAN_WZO_Msk & (_UINT32_(value) << ETH_MAN_WZO_Pos)) /* Assigment of value for WZO in the ETH_MAN register */
#define ETH_MAN_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_MAN) Register Mask  */


/* -------- ETH_MCF : (ETH Offset: 0x113C) ( R/ 32) Multiple Collision Frames Register -------- */
#define ETH_MCF_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_MCF) Multiple Collision Frames Register  Reset Value */

#define ETH_MCF_MCOL_Pos                      _UINT32_(0)                                          /* (ETH_MCF) Multiple Collision Position */
#define ETH_MCF_MCOL_Msk                      (_UINT32_(0x3FFFF) << ETH_MCF_MCOL_Pos)              /* (ETH_MCF) Multiple Collision Mask */
#define ETH_MCF_MCOL(value)                   (ETH_MCF_MCOL_Msk & (_UINT32_(value) << ETH_MCF_MCOL_Pos)) /* Assigment of value for MCOL in the ETH_MCF register */
#define ETH_MCF_Msk                           _UINT32_(0x0003FFFF)                                 /* (ETH_MCF) Register Mask  */


/* -------- ETH_MFR : (ETH Offset: 0x1160) ( R/ 32) Multicast Frames Received Register -------- */
#define ETH_MFR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_MFR) Multicast Frames Received Register  Reset Value */

#define ETH_MFR_MFRX_Pos                      _UINT32_(0)                                          /* (ETH_MFR) Multicast Frames Received without Error Position */
#define ETH_MFR_MFRX_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_MFR_MFRX_Pos)           /* (ETH_MFR) Multicast Frames Received without Error Mask */
#define ETH_MFR_MFRX(value)                   (ETH_MFR_MFRX_Msk & (_UINT32_(value) << ETH_MFR_MFRX_Pos)) /* Assigment of value for MFRX in the ETH_MFR register */
#define ETH_MFR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_MFR) Register Mask  */


/* -------- ETH_MFT : (ETH Offset: 0x1110) ( R/ 32) Multicast Frames Transmitted Register -------- */
#define ETH_MFT_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_MFT) Multicast Frames Transmitted Register  Reset Value */

