Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
/* -------- ETH_NCR : (ETH Offset: 0x1000) (R/W 32) Network Control Register -------- */
#define ETH_NCR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_NCR) Network Control Register  Reset Value */

#define ETH_NCR_LBL_Pos                       _UINT32_(1)                                          /* (ETH_NCR) Loop Back Local Position */
#define ETH_NCR_LBL_Msk                       (_UINT32_(0x1) << ETH_NCR_LBL_Pos)                   /* (ETH_NCR) Loop Back Local Mask */
#define ETH_NCR_LBL(value)                    (ETH_NCR_LBL_Msk & (_UINT32_(value) << ETH_NCR_LBL_Pos)) /* Assigment of value for LBL in the ETH_NCR register */
#define ETH_NCR_RXEN_Pos                      _UINT32_(2)                                          /* (ETH_NCR) Receive Enable Position */
#define ETH_NCR_RXEN_Msk                      (_UINT32_(0x1) << ETH_NCR_RXEN_Pos)                  /* (ETH_NCR) Receive Enable Mask */
#define ETH_NCR_RXEN(value)                   (ETH_NCR_RXEN_Msk & (_UINT32_(value) << ETH_NCR_RXEN_Pos)) /* Assigment of value for RXEN in the ETH_NCR register */
#define ETH_NCR_TXEN_Pos                      _UINT32_(3)                                          /* (ETH_NCR) Transmit Enable Position */
#define ETH_NCR_TXEN_Msk                      (_UINT32_(0x1) << ETH_NCR_TXEN_Pos)                  /* (ETH_NCR) Transmit Enable Mask */
#define ETH_NCR_TXEN(value)                   (ETH_NCR_TXEN_Msk & (_UINT32_(value) << ETH_NCR_TXEN_Pos)) /* Assigment of value for TXEN in the ETH_NCR register */
#define ETH_NCR_MPE_Pos                       _UINT32_(4)                                          /* (ETH_NCR) Management Port Enable Position */
#define ETH_NCR_MPE_Msk                       (_UINT32_(0x1) << ETH_NCR_MPE_Pos)                   /* (ETH_NCR) Management Port Enable Mask */
#define ETH_NCR_MPE(value)                    (ETH_NCR_MPE_Msk & (_UINT32_(value) << ETH_NCR_MPE_Pos)) /* Assigment of value for MPE in the ETH_NCR register */
#define ETH_NCR_CLRSTAT_Pos                   _UINT32_(5)                                          /* (ETH_NCR) Clear Statistics Registers Position */
#define ETH_NCR_CLRSTAT_Msk                   (_UINT32_(0x1) << ETH_NCR_CLRSTAT_Pos)               /* (ETH_NCR) Clear Statistics Registers Mask */
#define ETH_NCR_CLRSTAT(value)                (ETH_NCR_CLRSTAT_Msk & (_UINT32_(value) << ETH_NCR_CLRSTAT_Pos)) /* Assigment of value for CLRSTAT in the ETH_NCR register */
#define ETH_NCR_INCSTAT_Pos                   _UINT32_(6)                                          /* (ETH_NCR) Increment Statistics Registers Position */
#define ETH_NCR_INCSTAT_Msk                   (_UINT32_(0x1) << ETH_NCR_INCSTAT_Pos)               /* (ETH_NCR) Increment Statistics Registers Mask */
#define ETH_NCR_INCSTAT(value)                (ETH_NCR_INCSTAT_Msk & (_UINT32_(value) << ETH_NCR_INCSTAT_Pos)) /* Assigment of value for INCSTAT in the ETH_NCR register */
#define ETH_NCR_WESTAT_Pos                    _UINT32_(7)                                          /* (ETH_NCR) Write Enable for Statistics Registers Position */
#define ETH_NCR_WESTAT_Msk                    (_UINT32_(0x1) << ETH_NCR_WESTAT_Pos)                /* (ETH_NCR) Write Enable for Statistics Registers Mask */
#define ETH_NCR_WESTAT(value)                 (ETH_NCR_WESTAT_Msk & (_UINT32_(value) << ETH_NCR_WESTAT_Pos)) /* Assigment of value for WESTAT in the ETH_NCR register */
#define ETH_NCR_BP_Pos                        _UINT32_(8)                                          /* (ETH_NCR) Back pressure Position */
#define ETH_NCR_BP_Msk                        (_UINT32_(0x1) << ETH_NCR_BP_Pos)                    /* (ETH_NCR) Back pressure Mask */
#define ETH_NCR_BP(value)                     (ETH_NCR_BP_Msk & (_UINT32_(value) << ETH_NCR_BP_Pos)) /* Assigment of value for BP in the ETH_NCR register */
#define ETH_NCR_TSTART_Pos                    _UINT32_(9)                                          /* (ETH_NCR) Start Transmission Position */
#define ETH_NCR_TSTART_Msk                    (_UINT32_(0x1) << ETH_NCR_TSTART_Pos)                /* (ETH_NCR) Start Transmission Mask */
#define ETH_NCR_TSTART(value)                 (ETH_NCR_TSTART_Msk & (_UINT32_(value) << ETH_NCR_TSTART_Pos)) /* Assigment of value for TSTART in the ETH_NCR register */
#define ETH_NCR_THALT_Pos                     _UINT32_(10)                                         /* (ETH_NCR) Transmit Halt Position */
#define ETH_NCR_THALT_Msk                     (_UINT32_(0x1) << ETH_NCR_THALT_Pos)                 /* (ETH_NCR) Transmit Halt Mask */
#define ETH_NCR_THALT(value)                  (ETH_NCR_THALT_Msk & (_UINT32_(value) << ETH_NCR_THALT_Pos)) /* Assigment of value for THALT in the ETH_NCR register */
#define ETH_NCR_TXPF_Pos                      _UINT32_(11)                                         /* (ETH_NCR) Transmit Pause Frame Position */
#define ETH_NCR_TXPF_Msk                      (_UINT32_(0x1) << ETH_NCR_TXPF_Pos)                  /* (ETH_NCR) Transmit Pause Frame Mask */
#define ETH_NCR_TXPF(value)                   (ETH_NCR_TXPF_Msk & (_UINT32_(value) << ETH_NCR_TXPF_Pos)) /* Assigment of value for TXPF in the ETH_NCR register */
#define ETH_NCR_TXZQPF_Pos                    _UINT32_(12)                                         /* (ETH_NCR) Transmit Zero Quantum Pause Frame Position */
#define ETH_NCR_TXZQPF_Msk                    (_UINT32_(0x1) << ETH_NCR_TXZQPF_Pos)                /* (ETH_NCR) Transmit Zero Quantum Pause Frame Mask */
#define ETH_NCR_TXZQPF(value)                 (ETH_NCR_TXZQPF_Msk & (_UINT32_(value) << ETH_NCR_TXZQPF_Pos)) /* Assigment of value for TXZQPF in the ETH_NCR register */
#define ETH_NCR_SRTSM_Pos                     _UINT32_(15)                                         /* (ETH_NCR) Store Receive Time Stamp to Memory Position */
#define ETH_NCR_SRTSM_Msk                     (_UINT32_(0x1) << ETH_NCR_SRTSM_Pos)                 /* (ETH_NCR) Store Receive Time Stamp to Memory Mask */
#define ETH_NCR_SRTSM(value)                  (ETH_NCR_SRTSM_Msk & (_UINT32_(value) << ETH_NCR_SRTSM_Pos)) /* Assigment of value for SRTSM in the ETH_NCR register */
#define ETH_NCR_ENPBPR_Pos                    _UINT32_(16)                                         /* (ETH_NCR) Enable PFC Priority-based Pause Reception Position */
#define ETH_NCR_ENPBPR_Msk                    (_UINT32_(0x1) << ETH_NCR_ENPBPR_Pos)                /* (ETH_NCR) Enable PFC Priority-based Pause Reception Mask */
#define ETH_NCR_ENPBPR(value)                 (ETH_NCR_ENPBPR_Msk & (_UINT32_(value) << ETH_NCR_ENPBPR_Pos)) /* Assigment of value for ENPBPR in the ETH_NCR register */
#define ETH_NCR_TXPBPF_Pos                    _UINT32_(17)                                         /* (ETH_NCR) Transmit PFC Priority-based Pause Frame Position */
#define ETH_NCR_TXPBPF_Msk                    (_UINT32_(0x1) << ETH_NCR_TXPBPF_Pos)                /* (ETH_NCR) Transmit PFC Priority-based Pause Frame Mask */
#define ETH_NCR_TXPBPF(value)                 (ETH_NCR_TXPBPF_Msk & (_UINT32_(value) << ETH_NCR_TXPBPF_Pos)) /* Assigment of value for TXPBPF in the ETH_NCR register */
#define ETH_NCR_FNP_Pos                       _UINT32_(18)                                         /* (ETH_NCR) Flush Next Packet Position */
#define ETH_NCR_FNP_Msk                       (_UINT32_(0x1) << ETH_NCR_FNP_Pos)                   /* (ETH_NCR) Flush Next Packet Mask */
#define ETH_NCR_FNP(value)                    (ETH_NCR_FNP_Msk & (_UINT32_(value) << ETH_NCR_FNP_Pos)) /* Assigment of value for FNP in the ETH_NCR register */
#define ETH_NCR_LPI_Pos                       _UINT32_(19)                                         /* (ETH_NCR) Low Power Idle Enable Position */
#define ETH_NCR_LPI_Msk                       (_UINT32_(0x1) << ETH_NCR_LPI_Pos)                   /* (ETH_NCR) Low Power Idle Enable Mask */
#define ETH_NCR_LPI(value)                    (ETH_NCR_LPI_Msk & (_UINT32_(value) << ETH_NCR_LPI_Pos)) /* Assigment of value for LPI in the ETH_NCR register */
#define ETH_NCR_Msk                           _UINT32_(0x000F9FFE)                                 /* (ETH_NCR) Register Mask  */


/* -------- ETH_NSC : (ETH Offset: 0x10DC) (R/W 32) Tsu timer comparison nanoseconds Register -------- */
#define ETH_NSC_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_NSC) Tsu timer comparison nanoseconds Register  Reset Value */

#define ETH_NSC_NANOSEC_Pos                   _UINT32_(0)                                          /* (ETH_NSC) 1588 Timer Nanosecond comparison value Position */
#define ETH_NSC_NANOSEC_Msk                   (_UINT32_(0x1FFFFF) << ETH_NSC_NANOSEC_Pos)          /* (ETH_NSC) 1588 Timer Nanosecond comparison value Mask */
#define ETH_NSC_NANOSEC(value)                (ETH_NSC_NANOSEC_Msk & (_UINT32_(value) << ETH_NSC_NANOSEC_Pos)) /* Assigment of value for NANOSEC in the ETH_NSC register */
#define ETH_NSC_Msk                           _UINT32_(0x001FFFFF)                                 /* (ETH_NSC) Register Mask  */


/* -------- ETH_NSR : (ETH Offset: 0x1008) ( R/ 32) Network Status Register -------- */
#define ETH_NSR_RESETVALUE                    _UINT32_(0x04)                                       /*  (ETH_NSR) Network Status Register  Reset Value */

#define ETH_NSR_MDIO_Pos                      _UINT32_(1)                                          /* (ETH_NSR) MDIO Input Status Position */
#define ETH_NSR_MDIO_Msk                      (_UINT32_(0x1) << ETH_NSR_MDIO_Pos)                  /* (ETH_NSR) MDIO Input Status Mask */
#define ETH_NSR_MDIO(value)                   (ETH_NSR_MDIO_Msk & (_UINT32_(value) << ETH_NSR_MDIO_Pos)) /* Assigment of value for MDIO in the ETH_NSR register */
#define ETH_NSR_IDLE_Pos                      _UINT32_(2)                                          /* (ETH_NSR) PHY Management Logic Idle Position */
#define ETH_NSR_IDLE_Msk                      (_UINT32_(0x1) << ETH_NSR_IDLE_Pos)                  /* (ETH_NSR) PHY Management Logic Idle Mask */
#define ETH_NSR_IDLE(value)                   (ETH_NSR_IDLE_Msk & (_UINT32_(value) << ETH_NSR_IDLE_Pos)) /* Assigment of value for IDLE in the ETH_NSR register */
#define ETH_NSR_Msk                           _UINT32_(0x00000006)                                 /* (ETH_NSR) Register Mask  */


/* -------- ETH_OFR : (ETH Offset: 0x1188) ( R/ 32) Oversize Frames Received Register -------- */
#define ETH_OFR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_OFR) Oversize Frames Received Register  Reset Value */

#define ETH_OFR_OFRX_Pos                      _UINT32_(0)                                          /* (ETH_OFR) Oversized Frames Received Position */
#define ETH_OFR_OFRX_Msk                      (_UINT32_(0x3FF) << ETH_OFR_OFRX_Pos)                /* (ETH_OFR) Oversized Frames Received Mask */
#define ETH_OFR_OFRX(value)                   (ETH_OFR_OFRX_Msk & (_UINT32_(value) << ETH_OFR_OFRX_Pos)) /* Assigment of value for OFRX in the ETH_OFR register */
#define ETH_OFR_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_OFR) Register Mask  */


/* -------- ETH_ORHI : (ETH Offset: 0x1154) ( R/ 32) Octets Received [47:32] Received -------- */
#define ETH_ORHI_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_ORHI) Octets Received [47:32] Received  Reset Value */

#define ETH_ORHI_RXO_Pos                      _UINT32_(0)                                          /* (ETH_ORHI) Received Octets Position */
#define ETH_ORHI_RXO_Msk                      (_UINT32_(0xFFFF) << ETH_ORHI_RXO_Pos)               /* (ETH_ORHI) Received Octets Mask */
#define ETH_ORHI_RXO(value)                   (ETH_ORHI_RXO_Msk & (_UINT32_(value) << ETH_ORHI_RXO_Pos)) /* Assigment of value for RXO in the ETH_ORHI register */
#define ETH_ORHI_Msk                          _UINT32_(0x0000FFFF)                                 /* (ETH_ORHI) Register Mask  */


/* -------- ETH_ORLO : (ETH Offset: 0x1150) ( R/ 32) Octets Received [31:0] Received -------- */
#define ETH_ORLO_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_ORLO) Octets Received [31:0] Received  Reset Value */

#define ETH_ORLO_RXO_Pos                      _UINT32_(0)                                          /* (ETH_ORLO) Received Octets Position */
#define ETH_ORLO_RXO_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_ORLO_RXO_Pos)           /* (ETH_ORLO) Received Octets Mask */
#define ETH_ORLO_RXO(value)                   (ETH_ORLO_RXO_Msk & (_UINT32_(value) << ETH_ORLO_RXO_Pos)) /* Assigment of value for RXO in the ETH_ORLO register */
#define ETH_ORLO_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_ORLO) Register Mask  */


