Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
/* -------- ETH_OTHI : (ETH Offset: 0x1104) ( R/ 32) Octets Transmitted [47:32] Register -------- */
#define ETH_OTHI_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_OTHI) Octets Transmitted [47:32] Register  Reset Value */

#define ETH_OTHI_TXO_Pos                      _UINT32_(0)                                          /* (ETH_OTHI) Transmitted Octets Position */
#define ETH_OTHI_TXO_Msk                      (_UINT32_(0xFFFF) << ETH_OTHI_TXO_Pos)               /* (ETH_OTHI) Transmitted Octets Mask */
#define ETH_OTHI_TXO(value)                   (ETH_OTHI_TXO_Msk & (_UINT32_(value) << ETH_OTHI_TXO_Pos)) /* Assigment of value for TXO in the ETH_OTHI register */
#define ETH_OTHI_Msk                          _UINT32_(0x0000FFFF)                                 /* (ETH_OTHI) Register Mask  */


/* -------- ETH_OTLO : (ETH Offset: 0x1100) ( R/ 32) Octets Transmitted [31:0] Register -------- */
#define ETH_OTLO_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_OTLO) Octets Transmitted [31:0] Register  Reset Value */

#define ETH_OTLO_TXO_Pos                      _UINT32_(0)                                          /* (ETH_OTLO) Transmitted Octets Position */
#define ETH_OTLO_TXO_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_OTLO_TXO_Pos)           /* (ETH_OTLO) Transmitted Octets Mask */
#define ETH_OTLO_TXO(value)                   (ETH_OTLO_TXO_Msk & (_UINT32_(value) << ETH_OTLO_TXO_Pos)) /* Assigment of value for TXO in the ETH_OTLO register */
#define ETH_OTLO_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_OTLO) Register Mask  */


/* -------- ETH_PEFRN : (ETH Offset: 0x11FC) ( R/ 32) PTP Peer Event Frame Received Nanoseconds -------- */
#define ETH_PEFRN_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_PEFRN) PTP Peer Event Frame Received Nanoseconds  Reset Value */

#define ETH_PEFRN_RUD_Pos                     _UINT32_(0)                                          /* (ETH_PEFRN) Register Update Position */
#define ETH_PEFRN_RUD_Msk                     (_UINT32_(0x3FFFFFFF) << ETH_PEFRN_RUD_Pos)          /* (ETH_PEFRN) Register Update Mask */
#define ETH_PEFRN_RUD(value)                  (ETH_PEFRN_RUD_Msk & (_UINT32_(value) << ETH_PEFRN_RUD_Pos)) /* Assigment of value for RUD in the ETH_PEFRN register */
#define ETH_PEFRN_Msk                         _UINT32_(0x3FFFFFFF)                                 /* (ETH_PEFRN) Register Mask  */


/* -------- ETH_PEFRSH : (ETH Offset: 0x10F4) ( R/ 32) PTP Peer Event Frame Received Seconds High Register -------- */
#define ETH_PEFRSH_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_PEFRSH) PTP Peer Event Frame Received Seconds High Register  Reset Value */

#define ETH_PEFRSH_RUD_Pos                    _UINT32_(0)                                          /* (ETH_PEFRSH) Register Update Position */
#define ETH_PEFRSH_RUD_Msk                    (_UINT32_(0xFFFF) << ETH_PEFRSH_RUD_Pos)             /* (ETH_PEFRSH) Register Update Mask */
#define ETH_PEFRSH_RUD(value)                 (ETH_PEFRSH_RUD_Msk & (_UINT32_(value) << ETH_PEFRSH_RUD_Pos)) /* Assigment of value for RUD in the ETH_PEFRSH register */
#define ETH_PEFRSH_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_PEFRSH) Register Mask  */


/* -------- ETH_PEFRSL : (ETH Offset: 0x11F8) ( R/ 32) PTP Peer Event Frame Received Seconds Low Register -------- */
#define ETH_PEFRSL_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_PEFRSL) PTP Peer Event Frame Received Seconds Low Register  Reset Value */

#define ETH_PEFRSL_RUD_Pos                    _UINT32_(0)                                          /* (ETH_PEFRSL) Register Update Position */
#define ETH_PEFRSL_RUD_Msk                    (_UINT32_(0xFFFFFFFF) << ETH_PEFRSL_RUD_Pos)         /* (ETH_PEFRSL) Register Update Mask */
#define ETH_PEFRSL_RUD(value)                 (ETH_PEFRSL_RUD_Msk & (_UINT32_(value) << ETH_PEFRSL_RUD_Pos)) /* Assigment of value for RUD in the ETH_PEFRSL register */
#define ETH_PEFRSL_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (ETH_PEFRSL) Register Mask  */


/* -------- ETH_PEFTN : (ETH Offset: 0x11F4) ( R/ 32) PTP Peer Event Frame Transmitted Nanoseconds -------- */
#define ETH_PEFTN_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_PEFTN) PTP Peer Event Frame Transmitted Nanoseconds  Reset Value */

#define ETH_PEFTN_RUD_Pos                     _UINT32_(0)                                          /* (ETH_PEFTN) Register Update Position */
#define ETH_PEFTN_RUD_Msk                     (_UINT32_(0x3FFFFFFF) << ETH_PEFTN_RUD_Pos)          /* (ETH_PEFTN) Register Update Mask */
#define ETH_PEFTN_RUD(value)                  (ETH_PEFTN_RUD_Msk & (_UINT32_(value) << ETH_PEFTN_RUD_Pos)) /* Assigment of value for RUD in the ETH_PEFTN register */
#define ETH_PEFTN_Msk                         _UINT32_(0x3FFFFFFF)                                 /* (ETH_PEFTN) Register Mask  */


/* -------- ETH_PEFTSH : (ETH Offset: 0x10F0) ( R/ 32) PTP Peer Event Frame Transmitted Seconds High Register -------- */
#define ETH_PEFTSH_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_PEFTSH) PTP Peer Event Frame Transmitted Seconds High Register  Reset Value */

#define ETH_PEFTSH_RUD_Pos                    _UINT32_(0)                                          /* (ETH_PEFTSH) Register Update Position */
#define ETH_PEFTSH_RUD_Msk                    (_UINT32_(0xFFFF) << ETH_PEFTSH_RUD_Pos)             /* (ETH_PEFTSH) Register Update Mask */
#define ETH_PEFTSH_RUD(value)                 (ETH_PEFTSH_RUD_Msk & (_UINT32_(value) << ETH_PEFTSH_RUD_Pos)) /* Assigment of value for RUD in the ETH_PEFTSH register */
#define ETH_PEFTSH_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_PEFTSH) Register Mask  */


/* -------- ETH_PEFTSL : (ETH Offset: 0x11F0) ( R/ 32) PTP Peer Event Frame Transmitted Seconds Low Register -------- */
#define ETH_PEFTSL_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_PEFTSL) PTP Peer Event Frame Transmitted Seconds Low Register  Reset Value */

#define ETH_PEFTSL_RUD_Pos                    _UINT32_(0)                                          /* (ETH_PEFTSL) Register Update Position */
#define ETH_PEFTSL_RUD_Msk                    (_UINT32_(0xFFFFFFFF) << ETH_PEFTSL_RUD_Pos)         /* (ETH_PEFTSL) Register Update Mask */
#define ETH_PEFTSL_RUD(value)                 (ETH_PEFTSL_RUD_Msk & (_UINT32_(value) << ETH_PEFTSL_RUD_Pos)) /* Assigment of value for RUD in the ETH_PEFTSL register */
#define ETH_PEFTSL_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (ETH_PEFTSL) Register Mask  */


/* -------- ETH_PFR : (ETH Offset: 0x1164) ( R/ 32) Pause Frames Received Register -------- */
#define ETH_PFR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_PFR) Pause Frames Received Register  Reset Value */

#define ETH_PFR_PFRX_Pos                      _UINT32_(0)                                          /* (ETH_PFR) Pause Frames Received Register Position */
#define ETH_PFR_PFRX_Msk                      (_UINT32_(0xFFFF) << ETH_PFR_PFRX_Pos)               /* (ETH_PFR) Pause Frames Received Register Mask */
#define ETH_PFR_PFRX(value)                   (ETH_PFR_PFRX_Msk & (_UINT32_(value) << ETH_PFR_PFRX_Pos)) /* Assigment of value for PFRX in the ETH_PFR register */
#define ETH_PFR_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_PFR) Register Mask  */


/* -------- ETH_PFT : (ETH Offset: 0x1114) ( R/ 32) Pause Frames Transmitted Register -------- */
#define ETH_PFT_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_PFT) Pause Frames Transmitted Register  Reset Value */

