Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
#define ETH_PFT_PFTX_Pos                      _UINT32_(0)                                          /* (ETH_PFT) Pause Frames Transmitted Register Position */
#define ETH_PFT_PFTX_Msk                      (_UINT32_(0xFFFF) << ETH_PFT_PFTX_Pos)               /* (ETH_PFT) Pause Frames Transmitted Register Mask */
#define ETH_PFT_PFTX(value)                   (ETH_PFT_PFTX_Msk & (_UINT32_(value) << ETH_PFT_PFTX_Pos)) /* Assigment of value for PFTX in the ETH_PFT register */
#define ETH_PFT_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_PFT) Register Mask  */


/* -------- ETH_RBQB : (ETH Offset: 0x1018) (R/W 32) Receive Buffer Queue Base Address -------- */
#define ETH_RBQB_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_RBQB) Receive Buffer Queue Base Address  Reset Value */

#define ETH_RBQB_ADDR_Pos                     _UINT32_(2)                                          /* (ETH_RBQB) Receive Buffer Queue Base Address Position */
#define ETH_RBQB_ADDR_Msk                     (_UINT32_(0x3FFFFFFF) << ETH_RBQB_ADDR_Pos)          /* (ETH_RBQB) Receive Buffer Queue Base Address Mask */
#define ETH_RBQB_ADDR(value)                  (ETH_RBQB_ADDR_Msk & (_UINT32_(value) << ETH_RBQB_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_RBQB register */
#define ETH_RBQB_Msk                          _UINT32_(0xFFFFFFFC)                                 /* (ETH_RBQB) Register Mask  */


/* -------- ETH_RJFML : (ETH Offset: 0x1048) (R/W 32) RX Jumbo Frame Max Length Register -------- */
#define ETH_RJFML_RESETVALUE                  _UINT32_(0x2800)                                     /*  (ETH_RJFML) RX Jumbo Frame Max Length Register  Reset Value */

#define ETH_RJFML_FML_Pos                     _UINT32_(0)                                          /* (ETH_RJFML) Frame Max Length Position */
#define ETH_RJFML_FML_Msk                     (_UINT32_(0x3FFF) << ETH_RJFML_FML_Pos)              /* (ETH_RJFML) Frame Max Length Mask */
#define ETH_RJFML_FML(value)                  (ETH_RJFML_FML_Msk & (_UINT32_(value) << ETH_RJFML_FML_Pos)) /* Assigment of value for FML in the ETH_RJFML register */
#define ETH_RJFML_Msk                         _UINT32_(0x00003FFF)                                 /* (ETH_RJFML) Register Mask  */


/* -------- ETH_RLPITI : (ETH Offset: 0x1274) ( R/ 32) Receive LPI Time Register -------- */
#define ETH_RLPITI_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_RLPITI) Receive LPI Time Register  Reset Value */

#define ETH_RLPITI_RLPITI_Pos                 _UINT32_(0)                                          /* (ETH_RLPITI) Increment once over 16 ahb clock when LPI indication bit 20 is set in rx mode Position */
#define ETH_RLPITI_RLPITI_Msk                 (_UINT32_(0xFFFFFF) << ETH_RLPITI_RLPITI_Pos)        /* (ETH_RLPITI) Increment once over 16 ahb clock when LPI indication bit 20 is set in rx mode Mask */
#define ETH_RLPITI_RLPITI(value)              (ETH_RLPITI_RLPITI_Msk & (_UINT32_(value) << ETH_RLPITI_RLPITI_Pos)) /* Assigment of value for RLPITI in the ETH_RLPITI register */
#define ETH_RLPITI_Msk                        _UINT32_(0x00FFFFFF)                                 /* (ETH_RLPITI) Register Mask  */


/* -------- ETH_RLPITR : (ETH Offset: 0x1270) ( R/ 32) Receive LPI transition Register -------- */
#define ETH_RLPITR_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_RLPITR) Receive LPI transition Register  Reset Value */

#define ETH_RLPITR_RLPITR_Pos                 _UINT32_(0)                                          /* (ETH_RLPITR) Count number of times transition from rx normal idle to low power idle Position */
#define ETH_RLPITR_RLPITR_Msk                 (_UINT32_(0xFFFF) << ETH_RLPITR_RLPITR_Pos)          /* (ETH_RLPITR) Count number of times transition from rx normal idle to low power idle Mask */
#define ETH_RLPITR_RLPITR(value)              (ETH_RLPITR_RLPITR_Msk & (_UINT32_(value) << ETH_RLPITR_RLPITR_Pos)) /* Assigment of value for RLPITR in the ETH_RLPITR register */
#define ETH_RLPITR_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_RLPITR) Register Mask  */


/* -------- ETH_ROE : (ETH Offset: 0x11A4) ( R/ 32) Receive Overrun Register -------- */
#define ETH_ROE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_ROE) Receive Overrun Register  Reset Value */

#define ETH_ROE_RXOVR_Pos                     _UINT32_(0)                                          /* (ETH_ROE) Receive Overruns Position */
#define ETH_ROE_RXOVR_Msk                     (_UINT32_(0x3FF) << ETH_ROE_RXOVR_Pos)               /* (ETH_ROE) Receive Overruns Mask */
#define ETH_ROE_RXOVR(value)                  (ETH_ROE_RXOVR_Msk & (_UINT32_(value) << ETH_ROE_RXOVR_Pos)) /* Assigment of value for RXOVR in the ETH_ROE register */
#define ETH_ROE_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_ROE) Register Mask  */


/* -------- ETH_RPQ : (ETH Offset: 0x1038) ( R/ 32) Received Pause Quantum Register -------- */
#define ETH_RPQ_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_RPQ) Received Pause Quantum Register  Reset Value */

#define ETH_RPQ_RPQ_Pos                       _UINT32_(0)                                          /* (ETH_RPQ) Received Pause Quantum Position */
#define ETH_RPQ_RPQ_Msk                       (_UINT32_(0xFFFF) << ETH_RPQ_RPQ_Pos)                /* (ETH_RPQ) Received Pause Quantum Mask */
#define ETH_RPQ_RPQ(value)                    (ETH_RPQ_RPQ_Msk & (_UINT32_(value) << ETH_RPQ_RPQ_Pos)) /* Assigment of value for RPQ in the ETH_RPQ register */
#define ETH_RPQ_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_RPQ) Register Mask  */


/* -------- ETH_RPSF : (ETH Offset: 0x1044) (R/W 32) RX partial store and forward Register -------- */
#define ETH_RPSF_RESETVALUE                   _UINT32_(0x3FF)                                      /*  (ETH_RPSF) RX partial store and forward Register  Reset Value */

#define ETH_RPSF_RPB1ADR_Pos                  _UINT32_(0)                                          /* (ETH_RPSF) RX packet buffer address Position */
#define ETH_RPSF_RPB1ADR_Msk                  (_UINT32_(0x3FF) << ETH_RPSF_RPB1ADR_Pos)            /* (ETH_RPSF) RX packet buffer address Mask */
#define ETH_RPSF_RPB1ADR(value)               (ETH_RPSF_RPB1ADR_Msk & (_UINT32_(value) << ETH_RPSF_RPB1ADR_Pos)) /* Assigment of value for RPB1ADR in the ETH_RPSF register */
#define ETH_RPSF_ENRXP_Pos                    _UINT32_(31)                                         /* (ETH_RPSF) Enable RX partial store and forward operation Position */
#define ETH_RPSF_ENRXP_Msk                    (_UINT32_(0x1) << ETH_RPSF_ENRXP_Pos)                /* (ETH_RPSF) Enable RX partial store and forward operation Mask */
#define ETH_RPSF_ENRXP(value)                 (ETH_RPSF_ENRXP_Msk & (_UINT32_(value) << ETH_RPSF_ENRXP_Pos)) /* Assigment of value for ENRXP in the ETH_RPSF register */
#define ETH_RPSF_Msk                          _UINT32_(0x800003FF)                                 /* (ETH_RPSF) Register Mask  */


/* -------- ETH_RRE : (ETH Offset: 0x11A0) ( R/ 32) Receive Resource Errors Register -------- */
#define ETH_RRE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_RRE) Receive Resource Errors Register  Reset Value */

