Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
#define ETH_RRE_RXRER_Pos                     _UINT32_(0)                                          /* (ETH_RRE) Receive Resource Errors Position */
#define ETH_RRE_RXRER_Msk                     (_UINT32_(0x3FFFF) << ETH_RRE_RXRER_Pos)             /* (ETH_RRE) Receive Resource Errors Mask */
#define ETH_RRE_RXRER(value)                  (ETH_RRE_RXRER_Msk & (_UINT32_(value) << ETH_RRE_RXRER_Pos)) /* Assigment of value for RXRER in the ETH_RRE register */
#define ETH_RRE_Msk                           _UINT32_(0x0003FFFF)                                 /* (ETH_RRE) Register Mask  */


/* -------- ETH_RSE : (ETH Offset: 0x1198) ( R/ 32) Receive Symbol Errors Register -------- */
#define ETH_RSE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_RSE) Receive Symbol Errors Register  Reset Value */

#define ETH_RSE_RXSE_Pos                      _UINT32_(0)                                          /* (ETH_RSE) Receive Symbol Errors Position */
#define ETH_RSE_RXSE_Msk                      (_UINT32_(0x3FF) << ETH_RSE_RXSE_Pos)                /* (ETH_RSE) Receive Symbol Errors Mask */
#define ETH_RSE_RXSE(value)                   (ETH_RSE_RXSE_Msk & (_UINT32_(value) << ETH_RSE_RXSE_Pos)) /* Assigment of value for RXSE in the ETH_RSE register */
#define ETH_RSE_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_RSE) Register Mask  */


/* -------- ETH_RSR : (ETH Offset: 0x1020) (R/W 32) Receive Status Register -------- */
#define ETH_RSR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_RSR) Receive Status Register  Reset Value */

#define ETH_RSR_BNA_Pos                       _UINT32_(0)                                          /* (ETH_RSR) Buffer Not Available Position */
#define ETH_RSR_BNA_Msk                       (_UINT32_(0x1) << ETH_RSR_BNA_Pos)                   /* (ETH_RSR) Buffer Not Available Mask */
#define ETH_RSR_BNA(value)                    (ETH_RSR_BNA_Msk & (_UINT32_(value) << ETH_RSR_BNA_Pos)) /* Assigment of value for BNA in the ETH_RSR register */
#define ETH_RSR_REC_Pos                       _UINT32_(1)                                          /* (ETH_RSR) Frame Received Position */
#define ETH_RSR_REC_Msk                       (_UINT32_(0x1) << ETH_RSR_REC_Pos)                   /* (ETH_RSR) Frame Received Mask */
#define ETH_RSR_REC(value)                    (ETH_RSR_REC_Msk & (_UINT32_(value) << ETH_RSR_REC_Pos)) /* Assigment of value for REC in the ETH_RSR register */
#define ETH_RSR_RXOVR_Pos                     _UINT32_(2)                                          /* (ETH_RSR) Receive Overrun Position */
#define ETH_RSR_RXOVR_Msk                     (_UINT32_(0x1) << ETH_RSR_RXOVR_Pos)                 /* (ETH_RSR) Receive Overrun Mask */
#define ETH_RSR_RXOVR(value)                  (ETH_RSR_RXOVR_Msk & (_UINT32_(value) << ETH_RSR_RXOVR_Pos)) /* Assigment of value for RXOVR in the ETH_RSR register */
#define ETH_RSR_HNO_Pos                       _UINT32_(3)                                          /* (ETH_RSR) HRESP Not OK Position */
#define ETH_RSR_HNO_Msk                       (_UINT32_(0x1) << ETH_RSR_HNO_Pos)                   /* (ETH_RSR) HRESP Not OK Mask */
#define ETH_RSR_HNO(value)                    (ETH_RSR_HNO_Msk & (_UINT32_(value) << ETH_RSR_HNO_Pos)) /* Assigment of value for HNO in the ETH_RSR register */
#define ETH_RSR_Msk                           _UINT32_(0x0000000F)                                 /* (ETH_RSR) Register Mask  */


/* -------- ETH_SAMB1 : (ETH Offset: 0x10C8) (R/W 32) Specific Address 1 Mask Bottom [31:0] Register -------- */
#define ETH_SAMB1_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SAMB1) Specific Address 1 Mask Bottom [31:0] Register  Reset Value */

#define ETH_SAMB1_ADDR_Pos                    _UINT32_(0)                                          /* (ETH_SAMB1) Specific Address 1 Mask Position */
#define ETH_SAMB1_ADDR_Msk                    (_UINT32_(0xFFFFFFFF) << ETH_SAMB1_ADDR_Pos)         /* (ETH_SAMB1) Specific Address 1 Mask Mask */
#define ETH_SAMB1_ADDR(value)                 (ETH_SAMB1_ADDR_Msk & (_UINT32_(value) << ETH_SAMB1_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_SAMB1 register */
#define ETH_SAMB1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_SAMB1) Register Mask  */


/* -------- ETH_SAMT1 : (ETH Offset: 0x10CC) (R/W 32) Specific Address 1 Mask Top [47:32] Register -------- */
#define ETH_SAMT1_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SAMT1) Specific Address 1 Mask Top [47:32] Register  Reset Value */

#define ETH_SAMT1_ADDR_Pos                    _UINT32_(0)                                          /* (ETH_SAMT1) Specific Address 1 Mask Position */
#define ETH_SAMT1_ADDR_Msk                    (_UINT32_(0xFFFF) << ETH_SAMT1_ADDR_Pos)             /* (ETH_SAMT1) Specific Address 1 Mask Mask */
#define ETH_SAMT1_ADDR(value)                 (ETH_SAMT1_ADDR_Msk & (_UINT32_(value) << ETH_SAMT1_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_SAMT1 register */
#define ETH_SAMT1_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_SAMT1) Register Mask  */


/* -------- ETH_SCF : (ETH Offset: 0x1138) ( R/ 32) Single Collision Frames Register -------- */
#define ETH_SCF_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SCF) Single Collision Frames Register  Reset Value */

#define ETH_SCF_SCOL_Pos                      _UINT32_(0)                                          /* (ETH_SCF) Single Collision Position */
#define ETH_SCF_SCOL_Msk                      (_UINT32_(0x3FFFF) << ETH_SCF_SCOL_Pos)              /* (ETH_SCF) Single Collision Mask */
#define ETH_SCF_SCOL(value)                   (ETH_SCF_SCOL_Msk & (_UINT32_(value) << ETH_SCF_SCOL_Pos)) /* Assigment of value for SCOL in the ETH_SCF register */
#define ETH_SCF_Msk                           _UINT32_(0x0003FFFF)                                 /* (ETH_SCF) Register Mask  */


