Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
/* -------- ETH_SCH : (ETH Offset: 0x10E4) (R/W 32) Tsu timer second comparison Register -------- */
#define ETH_SCH_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SCH) Tsu timer second comparison Register  Reset Value */

#define ETH_SCH_SEC_Pos                       _UINT32_(0)                                          /* (ETH_SCH) 1588 Timer Second comparison value Position */
#define ETH_SCH_SEC_Msk                       (_UINT32_(0xFFFF) << ETH_SCH_SEC_Pos)                /* (ETH_SCH) 1588 Timer Second comparison value Mask */
#define ETH_SCH_SEC(value)                    (ETH_SCH_SEC_Msk & (_UINT32_(value) << ETH_SCH_SEC_Pos)) /* Assigment of value for SEC in the ETH_SCH register */
#define ETH_SCH_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_SCH) Register Mask  */


/* -------- ETH_SCL : (ETH Offset: 0x10E0) (R/W 32) Tsu timer second comparison Register -------- */
#define ETH_SCL_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SCL) Tsu timer second comparison Register  Reset Value */

#define ETH_SCL_SEC_Pos                       _UINT32_(0)                                          /* (ETH_SCL) 1588 Timer Second comparison value Position */
#define ETH_SCL_SEC_Msk                       (_UINT32_(0xFFFFFFFF) << ETH_SCL_SEC_Pos)            /* (ETH_SCL) 1588 Timer Second comparison value Mask */
#define ETH_SCL_SEC(value)                    (ETH_SCL_SEC_Msk & (_UINT32_(value) << ETH_SCL_SEC_Pos)) /* Assigment of value for SEC in the ETH_SCL register */
#define ETH_SCL_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_SCL) Register Mask  */


/* -------- ETH_SVLAN : (ETH Offset: 0x10C0) (R/W 32) Stacked VLAN Register -------- */
#define ETH_SVLAN_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SVLAN) Stacked VLAN Register  Reset Value */

#define ETH_SVLAN_VLAN_TYPE_Pos               _UINT32_(0)                                          /* (ETH_SVLAN) User Defined VLAN_TYPE Field Position */
#define ETH_SVLAN_VLAN_TYPE_Msk               (_UINT32_(0xFFFF) << ETH_SVLAN_VLAN_TYPE_Pos)        /* (ETH_SVLAN) User Defined VLAN_TYPE Field Mask */
#define ETH_SVLAN_VLAN_TYPE(value)            (ETH_SVLAN_VLAN_TYPE_Msk & (_UINT32_(value) << ETH_SVLAN_VLAN_TYPE_Pos)) /* Assigment of value for VLAN_TYPE in the ETH_SVLAN register */
#define ETH_SVLAN_ESVLAN_Pos                  _UINT32_(31)                                         /* (ETH_SVLAN) Enable Stacked VLAN Processing Mode Position */
#define ETH_SVLAN_ESVLAN_Msk                  (_UINT32_(0x1) << ETH_SVLAN_ESVLAN_Pos)              /* (ETH_SVLAN) Enable Stacked VLAN Processing Mode Mask */
#define ETH_SVLAN_ESVLAN(value)               (ETH_SVLAN_ESVLAN_Msk & (_UINT32_(value) << ETH_SVLAN_ESVLAN_Pos)) /* Assigment of value for ESVLAN in the ETH_SVLAN register */
#define ETH_SVLAN_Msk                         _UINT32_(0x8000FFFF)                                 /* (ETH_SVLAN) Register Mask  */


/* -------- ETH_SYNCB : (ETH Offset: 0x20) ( R/ 32) Sync Busy Register -------- */
#define ETH_SYNCB_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SYNCB) Sync Busy Register  Reset Value */

#define ETH_SYNCB_SWRST_Pos                   _UINT32_(0)                                          /* (ETH_SYNCB) Software Reset Sync Busy Position */
#define ETH_SYNCB_SWRST_Msk                   (_UINT32_(0x1) << ETH_SYNCB_SWRST_Pos)               /* (ETH_SYNCB) Software Reset Sync Busy Mask */
#define ETH_SYNCB_SWRST(value)                (ETH_SYNCB_SWRST_Msk & (_UINT32_(value) << ETH_SYNCB_SWRST_Pos)) /* Assigment of value for SWRST in the ETH_SYNCB register */
#define ETH_SYNCB_ENABLE_Pos                  _UINT32_(1)                                          /* (ETH_SYNCB) Enable Sync Busy Position */
#define ETH_SYNCB_ENABLE_Msk                  (_UINT32_(0x1) << ETH_SYNCB_ENABLE_Pos)              /* (ETH_SYNCB) Enable Sync Busy Mask */
#define ETH_SYNCB_ENABLE(value)               (ETH_SYNCB_ENABLE_Msk & (_UINT32_(value) << ETH_SYNCB_ENABLE_Pos)) /* Assigment of value for ENABLE in the ETH_SYNCB register */
#define ETH_SYNCB_Msk                         _UINT32_(0x00000003)                                 /* (ETH_SYNCB) Register Mask  */


/* -------- ETH_TA : (ETH Offset: 0x11D8) ( /W 32) 1588 Timer Adjust Register -------- */
#define ETH_TA_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_TA) 1588 Timer Adjust Register  Reset Value */

#define ETH_TA_ITDT_Pos                       _UINT32_(0)                                          /* (ETH_TA) Increment/Decrement Position */
#define ETH_TA_ITDT_Msk                       (_UINT32_(0x3FFFFFFF) << ETH_TA_ITDT_Pos)            /* (ETH_TA) Increment/Decrement Mask */
#define ETH_TA_ITDT(value)                    (ETH_TA_ITDT_Msk & (_UINT32_(value) << ETH_TA_ITDT_Pos)) /* Assigment of value for ITDT in the ETH_TA register */
#define ETH_TA_ADJ_Pos                        _UINT32_(31)                                         /* (ETH_TA) Adjust 1588 Timer Position */
#define ETH_TA_ADJ_Msk                        (_UINT32_(0x1) << ETH_TA_ADJ_Pos)                    /* (ETH_TA) Adjust 1588 Timer Mask */
#define ETH_TA_ADJ(value)                     (ETH_TA_ADJ_Msk & (_UINT32_(value) << ETH_TA_ADJ_Pos)) /* Assigment of value for ADJ in the ETH_TA register */
#define ETH_TA_Msk                            _UINT32_(0xBFFFFFFF)                                 /* (ETH_TA) Register Mask  */


/* -------- ETH_TBFR1023 : (ETH Offset: 0x1178) ( R/ 32) 512 to 1023 Byte Frames Received Register -------- */
#define ETH_TBFR1023_RESETVALUE               _UINT32_(0x00)                                       /*  (ETH_TBFR1023) 512 to 1023 Byte Frames Received Register  Reset Value */

#define ETH_TBFR1023_NFRX_Pos                 _UINT32_(0)                                          /* (ETH_TBFR1023) 512 to 1023 Byte Frames Received without Error Position */
#define ETH_TBFR1023_NFRX_Msk                 (_UINT32_(0xFFFFFFFF) << ETH_TBFR1023_NFRX_Pos)      /* (ETH_TBFR1023) 512 to 1023 Byte Frames Received without Error Mask */
#define ETH_TBFR1023_NFRX(value)              (ETH_TBFR1023_NFRX_Msk & (_UINT32_(value) << ETH_TBFR1023_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR1023 register */
#define ETH_TBFR1023_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR1023) Register Mask  */


