Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
/* -------- ETH_TBFR127 : (ETH Offset: 0x116C) ( R/ 32) 65 to 127 Byte Frames Received Register -------- */
#define ETH_TBFR127_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFR127) 65 to 127 Byte Frames Received Register  Reset Value */

#define ETH_TBFR127_NFRX_Pos                  _UINT32_(0)                                          /* (ETH_TBFR127) 65 to 127 Byte Frames Received without Error Position */
#define ETH_TBFR127_NFRX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFR127_NFRX_Pos)       /* (ETH_TBFR127) 65 to 127 Byte Frames Received without Error Mask */
#define ETH_TBFR127_NFRX(value)               (ETH_TBFR127_NFRX_Msk & (_UINT32_(value) << ETH_TBFR127_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR127 register */
#define ETH_TBFR127_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR127) Register Mask  */


/* -------- ETH_TBFR1518 : (ETH Offset: 0x117C) ( R/ 32) 1024 to 1518 Byte Frames Received Register -------- */
#define ETH_TBFR1518_RESETVALUE               _UINT32_(0x00)                                       /*  (ETH_TBFR1518) 1024 to 1518 Byte Frames Received Register  Reset Value */

#define ETH_TBFR1518_NFRX_Pos                 _UINT32_(0)                                          /* (ETH_TBFR1518) 1024 to 1518 Byte Frames Received without Error Position */
#define ETH_TBFR1518_NFRX_Msk                 (_UINT32_(0xFFFFFFFF) << ETH_TBFR1518_NFRX_Pos)      /* (ETH_TBFR1518) 1024 to 1518 Byte Frames Received without Error Mask */
#define ETH_TBFR1518_NFRX(value)              (ETH_TBFR1518_NFRX_Msk & (_UINT32_(value) << ETH_TBFR1518_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR1518 register */
#define ETH_TBFR1518_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR1518) Register Mask  */


/* -------- ETH_TBFR255 : (ETH Offset: 0x1170) ( R/ 32) 128 to 255 Byte Frames Received Register -------- */
#define ETH_TBFR255_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFR255) 128 to 255 Byte Frames Received Register  Reset Value */

#define ETH_TBFR255_NFRX_Pos                  _UINT32_(0)                                          /* (ETH_TBFR255) 128 to 255 Byte Frames Received without Error Position */
#define ETH_TBFR255_NFRX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFR255_NFRX_Pos)       /* (ETH_TBFR255) 128 to 255 Byte Frames Received without Error Mask */
#define ETH_TBFR255_NFRX(value)               (ETH_TBFR255_NFRX_Msk & (_UINT32_(value) << ETH_TBFR255_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR255 register */
#define ETH_TBFR255_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR255) Register Mask  */


/* -------- ETH_TBFR511 : (ETH Offset: 0x1174) ( R/ 32) 256 to 511Byte Frames Received Register -------- */
#define ETH_TBFR511_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFR511) 256 to 511Byte Frames Received Register  Reset Value */

#define ETH_TBFR511_NFRX_Pos                  _UINT32_(0)                                          /* (ETH_TBFR511) 256 to 511 Byte Frames Received without Error Position */
#define ETH_TBFR511_NFRX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFR511_NFRX_Pos)       /* (ETH_TBFR511) 256 to 511 Byte Frames Received without Error Mask */
#define ETH_TBFR511_NFRX(value)               (ETH_TBFR511_NFRX_Msk & (_UINT32_(value) << ETH_TBFR511_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR511 register */
#define ETH_TBFR511_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR511) Register Mask  */


/* -------- ETH_TBFT1023 : (ETH Offset: 0x1128) ( R/ 32) 512 to 1023 Byte Frames Transmitted Register -------- */
#define ETH_TBFT1023_RESETVALUE               _UINT32_(0x00)                                       /*  (ETH_TBFT1023) 512 to 1023 Byte Frames Transmitted Register  Reset Value */

#define ETH_TBFT1023_NFTX_Pos                 _UINT32_(0)                                          /* (ETH_TBFT1023) 512 to 1023 Byte Frames Transmitted without Error Position */
#define ETH_TBFT1023_NFTX_Msk                 (_UINT32_(0xFFFFFFFF) << ETH_TBFT1023_NFTX_Pos)      /* (ETH_TBFT1023) 512 to 1023 Byte Frames Transmitted without Error Mask */
#define ETH_TBFT1023_NFTX(value)              (ETH_TBFT1023_NFTX_Msk & (_UINT32_(value) << ETH_TBFT1023_NFTX_Pos)) /* Assigment of value for NFTX in the ETH_TBFT1023 register */
#define ETH_TBFT1023_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFT1023) Register Mask  */


/* -------- ETH_TBFT127 : (ETH Offset: 0x111C) ( R/ 32) 65 to 127 Byte Frames Transmitted Register -------- */
#define ETH_TBFT127_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFT127) 65 to 127 Byte Frames Transmitted Register  Reset Value */

#define ETH_TBFT127_NFTX_Pos                  _UINT32_(0)                                          /* (ETH_TBFT127) 65 to 127 Byte Frames Transmitted without Error Position */
#define ETH_TBFT127_NFTX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFT127_NFTX_Pos)       /* (ETH_TBFT127) 65 to 127 Byte Frames Transmitted without Error Mask */
#define ETH_TBFT127_NFTX(value)               (ETH_TBFT127_NFTX_Msk & (_UINT32_(value) << ETH_TBFT127_NFTX_Pos)) /* Assigment of value for NFTX in the ETH_TBFT127 register */
#define ETH_TBFT127_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFT127) Register Mask  */


/* -------- ETH_TBFT1518 : (ETH Offset: 0x112C) ( R/ 32) 1024 to 1518 Byte Frames Transmitted Register -------- */
#define ETH_TBFT1518_RESETVALUE               _UINT32_(0x00)                                       /*  (ETH_TBFT1518) 1024 to 1518 Byte Frames Transmitted Register  Reset Value */

#define ETH_TBFT1518_NFTX_Pos                 _UINT32_(0)                                          /* (ETH_TBFT1518) 1024 to 1518 Byte Frames Transmitted without Error Position */
#define ETH_TBFT1518_NFTX_Msk                 (_UINT32_(0xFFFFFFFF) << ETH_TBFT1518_NFTX_Pos)      /* (ETH_TBFT1518) 1024 to 1518 Byte Frames Transmitted without Error Mask */
#define ETH_TBFT1518_NFTX(value)              (ETH_TBFT1518_NFTX_Msk & (_UINT32_(value) << ETH_TBFT1518_NFTX_Pos)) /* Assigment of value for NFTX in the ETH_TBFT1518 register */
#define ETH_TBFT1518_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFT1518) Register Mask  */


/* -------- ETH_TBFT255 : (ETH Offset: 0x1120) ( R/ 32) 128 to 255 Byte Frames Transmitted Register -------- */
#define ETH_TBFT255_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFT255) 128 to 255 Byte Frames Transmitted Register  Reset Value */

