Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
#define ETH_TBFT255_NFTX_Pos                  _UINT32_(0)                                          /* (ETH_TBFT255) 128 to 255 Byte Frames Transmitted without Error Position */
#define ETH_TBFT255_NFTX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFT255_NFTX_Pos)       /* (ETH_TBFT255) 128 to 255 Byte Frames Transmitted without Error Mask */
#define ETH_TBFT255_NFTX(value)               (ETH_TBFT255_NFTX_Msk & (_UINT32_(value) << ETH_TBFT255_NFTX_Pos)) /* Assigment of value for NFTX in the ETH_TBFT255 register */
#define ETH_TBFT255_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFT255) Register Mask  */


/* -------- ETH_TBFT511 : (ETH Offset: 0x1124) ( R/ 32) 256 to 511 Byte Frames Transmitted Register -------- */
#define ETH_TBFT511_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFT511) 256 to 511 Byte Frames Transmitted Register  Reset Value */

#define ETH_TBFT511_NFTX_Pos                  _UINT32_(0)                                          /* (ETH_TBFT511) 256 to 511 Byte Frames Transmitted without Error Position */
#define ETH_TBFT511_NFTX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFT511_NFTX_Pos)       /* (ETH_TBFT511) 256 to 511 Byte Frames Transmitted without Error Mask */
#define ETH_TBFT511_NFTX(value)               (ETH_TBFT511_NFTX_Msk & (_UINT32_(value) << ETH_TBFT511_NFTX_Pos)) /* Assigment of value for NFTX in the ETH_TBFT511 register */
#define ETH_TBFT511_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFT511) Register Mask  */


/* -------- ETH_TBQB : (ETH Offset: 0x101C) (R/W 32) Transmit Buffer Queue Base Address -------- */
#define ETH_TBQB_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_TBQB) Transmit Buffer Queue Base Address  Reset Value */

#define ETH_TBQB_ADDR_Pos                     _UINT32_(2)                                          /* (ETH_TBQB) Transmit Buffer Queue Base Address Position */
#define ETH_TBQB_ADDR_Msk                     (_UINT32_(0x3FFFFFFF) << ETH_TBQB_ADDR_Pos)          /* (ETH_TBQB) Transmit Buffer Queue Base Address Mask */
#define ETH_TBQB_ADDR(value)                  (ETH_TBQB_ADDR_Msk & (_UINT32_(value) << ETH_TBQB_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_TBQB register */
#define ETH_TBQB_Msk                          _UINT32_(0xFFFFFFFC)                                 /* (ETH_TBQB) Register Mask  */


/* -------- ETH_TCE : (ETH Offset: 0x11AC) ( R/ 32) TCP Checksum Errors Register -------- */
#define ETH_TCE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TCE) TCP Checksum Errors Register  Reset Value */

#define ETH_TCE_TCKER_Pos                     _UINT32_(0)                                          /* (ETH_TCE) TCP Checksum Errors Position */
#define ETH_TCE_TCKER_Msk                     (_UINT32_(0xFF) << ETH_TCE_TCKER_Pos)                /* (ETH_TCE) TCP Checksum Errors Mask */
#define ETH_TCE_TCKER(value)                  (ETH_TCE_TCKER_Msk & (_UINT32_(value) << ETH_TCE_TCKER_Pos)) /* Assigment of value for TCKER in the ETH_TCE register */
#define ETH_TCE_Msk                           _UINT32_(0x000000FF)                                 /* (ETH_TCE) Register Mask  */


/* -------- ETH_TI : (ETH Offset: 0x11DC) (R/W 32) 1588 Timer Increment Register -------- */
#define ETH_TI_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_TI) 1588 Timer Increment Register  Reset Value */

#define ETH_TI_CNS_Pos                        _UINT32_(0)                                          /* (ETH_TI) Count Nanoseconds Position */
#define ETH_TI_CNS_Msk                        (_UINT32_(0xFF) << ETH_TI_CNS_Pos)                   /* (ETH_TI) Count Nanoseconds Mask */
#define ETH_TI_CNS(value)                     (ETH_TI_CNS_Msk & (_UINT32_(value) << ETH_TI_CNS_Pos)) /* Assigment of value for CNS in the ETH_TI register */
#define ETH_TI_ACNS_Pos                       _UINT32_(8)                                          /* (ETH_TI) Alternative Count Nanoseconds Position */
#define ETH_TI_ACNS_Msk                       (_UINT32_(0xFF) << ETH_TI_ACNS_Pos)                  /* (ETH_TI) Alternative Count Nanoseconds Mask */
#define ETH_TI_ACNS(value)                    (ETH_TI_ACNS_Msk & (_UINT32_(value) << ETH_TI_ACNS_Pos)) /* Assigment of value for ACNS in the ETH_TI register */
#define ETH_TI_NIT_Pos                        _UINT32_(16)                                         /* (ETH_TI) Number of Increments Position */
#define ETH_TI_NIT_Msk                        (_UINT32_(0xFF) << ETH_TI_NIT_Pos)                   /* (ETH_TI) Number of Increments Mask */
#define ETH_TI_NIT(value)                     (ETH_TI_NIT_Msk & (_UINT32_(value) << ETH_TI_NIT_Pos)) /* Assigment of value for NIT in the ETH_TI register */
#define ETH_TI_Msk                            _UINT32_(0x00FFFFFF)                                 /* (ETH_TI) Register Mask  */


/* -------- ETH_TIDM : (ETH Offset: 0x10A8) (R/W 32) Type ID Match Register -------- */
#define ETH_TIDM_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_TIDM) Type ID Match Register  Reset Value */

#define ETH_TIDM_TID_Pos                      _UINT32_(0)                                          /* (ETH_TIDM) Type ID Match 1 Position */
#define ETH_TIDM_TID_Msk                      (_UINT32_(0xFFFF) << ETH_TIDM_TID_Pos)               /* (ETH_TIDM) Type ID Match 1 Mask */
#define ETH_TIDM_TID(value)                   (ETH_TIDM_TID_Msk & (_UINT32_(value) << ETH_TIDM_TID_Pos)) /* Assigment of value for TID in the ETH_TIDM register */
#define ETH_TIDM_Msk                          _UINT32_(0x0000FFFF)                                 /* (ETH_TIDM) Register Mask  */


/* -------- ETH_TISUBN : (ETH Offset: 0x11BC) (R/W 32) 1588 Timer Increment [15:0] Sub-Nanoseconds Register -------- */
#define ETH_TISUBN_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_TISUBN) 1588 Timer Increment [15:0] Sub-Nanoseconds Register  Reset Value */

#define ETH_TISUBN_LSBTIR_Pos                 _UINT32_(0)                                          /* (ETH_TISUBN) Lower Significant Bits of Timer Increment Position */
#define ETH_TISUBN_LSBTIR_Msk                 (_UINT32_(0xFFFF) << ETH_TISUBN_LSBTIR_Pos)          /* (ETH_TISUBN) Lower Significant Bits of Timer Increment Mask */
#define ETH_TISUBN_LSBTIR(value)              (ETH_TISUBN_LSBTIR_Msk & (_UINT32_(value) << ETH_TISUBN_LSBTIR_Pos)) /* Assigment of value for LSBTIR in the ETH_TISUBN register */
#define ETH_TISUBN_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_TISUBN) Register Mask  */


/* -------- ETH_TLPITI : (ETH Offset: 0x127C) ( R/ 32) Receive LPI Time Register -------- */
#define ETH_TLPITI_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_TLPITI) Receive LPI Time Register  Reset Value */

#define ETH_TLPITI_TLPITI_Pos                 _UINT32_(0)                                          /* (ETH_TLPITI) Increment once over 16 ahb clock when LPI indication bit 20 is set in tx mode Position */
#define ETH_TLPITI_TLPITI_Msk                 (_UINT32_(0xFFFFFF) << ETH_TLPITI_TLPITI_Pos)        /* (ETH_TLPITI) Increment once over 16 ahb clock when LPI indication bit 20 is set in tx mode Mask */
#define ETH_TLPITI_TLPITI(value)              (ETH_TLPITI_TLPITI_Msk & (_UINT32_(value) << ETH_TLPITI_TLPITI_Pos)) /* Assigment of value for TLPITI in the ETH_TLPITI register */
#define ETH_TLPITI_Msk                        _UINT32_(0x00FFFFFF)                                 /* (ETH_TLPITI) Register Mask  */


/* -------- ETH_TLPITR : (ETH Offset: 0x1278) ( R/ 32) Receive LPI transition Register -------- */
#define ETH_TLPITR_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_TLPITR) Receive LPI transition Register  Reset Value */

