Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
#define ETH_TLPITR_TLPITR_Pos                 _UINT32_(0)                                          /* (ETH_TLPITR) Count number of times enable LPI tx bit 20 goes from low to high Position */
#define ETH_TLPITR_TLPITR_Msk                 (_UINT32_(0xFFFF) << ETH_TLPITR_TLPITR_Pos)          /* (ETH_TLPITR) Count number of times enable LPI tx bit 20 goes from low to high Mask */
#define ETH_TLPITR_TLPITR(value)              (ETH_TLPITR_TLPITR_Msk & (_UINT32_(value) << ETH_TLPITR_TLPITR_Pos)) /* Assigment of value for TLPITR in the ETH_TLPITR register */
#define ETH_TLPITR_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_TLPITR) Register Mask  */


/* -------- ETH_TMXBFR : (ETH Offset: 0x1180) ( R/ 32) 1519 to Maximum Byte Frames Received Register -------- */
#define ETH_TMXBFR_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_TMXBFR) 1519 to Maximum Byte Frames Received Register  Reset Value */

#define ETH_TMXBFR_NFRX_Pos                   _UINT32_(0)                                          /* (ETH_TMXBFR) 1519 to Maximum Byte Frames Received without Error Position */
#define ETH_TMXBFR_NFRX_Msk                   (_UINT32_(0xFFFFFFFF) << ETH_TMXBFR_NFRX_Pos)        /* (ETH_TMXBFR) 1519 to Maximum Byte Frames Received without Error Mask */
#define ETH_TMXBFR_NFRX(value)                (ETH_TMXBFR_NFRX_Msk & (_UINT32_(value) << ETH_TMXBFR_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TMXBFR register */
#define ETH_TMXBFR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (ETH_TMXBFR) Register Mask  */


/* -------- ETH_TN : (ETH Offset: 0x11D4) (R/W 32) 1588 Timer Nanoseconds Register -------- */
#define ETH_TN_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_TN) 1588 Timer Nanoseconds Register  Reset Value */

#define ETH_TN_TNS_Pos                        _UINT32_(0)                                          /* (ETH_TN) Timer Count in Nanoseconds Position */
#define ETH_TN_TNS_Msk                        (_UINT32_(0x3FFFFFFF) << ETH_TN_TNS_Pos)             /* (ETH_TN) Timer Count in Nanoseconds Mask */
#define ETH_TN_TNS(value)                     (ETH_TN_TNS_Msk & (_UINT32_(value) << ETH_TN_TNS_Pos)) /* Assigment of value for TNS in the ETH_TN register */
#define ETH_TN_Msk                            _UINT32_(0x3FFFFFFF)                                 /* (ETH_TN) Register Mask  */


/* -------- ETH_TPFCP : (ETH Offset: 0x10C4) (R/W 32) Transmit PFC Pause Register -------- */
#define ETH_TPFCP_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_TPFCP) Transmit PFC Pause Register  Reset Value */

#define ETH_TPFCP_PEV_Pos                     _UINT32_(0)                                          /* (ETH_TPFCP) Priority Enable Vector Position */
#define ETH_TPFCP_PEV_Msk                     (_UINT32_(0xFF) << ETH_TPFCP_PEV_Pos)                /* (ETH_TPFCP) Priority Enable Vector Mask */
#define ETH_TPFCP_PEV(value)                  (ETH_TPFCP_PEV_Msk & (_UINT32_(value) << ETH_TPFCP_PEV_Pos)) /* Assigment of value for PEV in the ETH_TPFCP register */
#define ETH_TPFCP_PQ_Pos                      _UINT32_(8)                                          /* (ETH_TPFCP) Pause Quantum Position */
#define ETH_TPFCP_PQ_Msk                      (_UINT32_(0xFF) << ETH_TPFCP_PQ_Pos)                 /* (ETH_TPFCP) Pause Quantum Mask */
#define ETH_TPFCP_PQ(value)                   (ETH_TPFCP_PQ_Msk & (_UINT32_(value) << ETH_TPFCP_PQ_Pos)) /* Assigment of value for PQ in the ETH_TPFCP register */
#define ETH_TPFCP_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_TPFCP) Register Mask  */


/* -------- ETH_TPQ : (ETH Offset: 0x103C) (R/W 32) Transmit Pause Quantum Register -------- */
#define ETH_TPQ_RESETVALUE                    _UINT32_(0xFFFF)                                     /*  (ETH_TPQ) Transmit Pause Quantum Register  Reset Value */

#define ETH_TPQ_TPQ_Pos                       _UINT32_(0)                                          /* (ETH_TPQ) Transmit Pause Quantum Position */
#define ETH_TPQ_TPQ_Msk                       (_UINT32_(0xFFFF) << ETH_TPQ_TPQ_Pos)                /* (ETH_TPQ) Transmit Pause Quantum Mask */
#define ETH_TPQ_TPQ(value)                    (ETH_TPQ_TPQ_Msk & (_UINT32_(value) << ETH_TPQ_TPQ_Pos)) /* Assigment of value for TPQ in the ETH_TPQ register */
#define ETH_TPQ_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_TPQ) Register Mask  */


/* -------- ETH_TPSF : (ETH Offset: 0x1040) (R/W 32) TX partial store and forward Register -------- */
#define ETH_TPSF_RESETVALUE                   _UINT32_(0x3FF)                                      /*  (ETH_TPSF) TX partial store and forward Register  Reset Value */

#define ETH_TPSF_TPB1ADR_Pos                  _UINT32_(0)                                          /* (ETH_TPSF) TX packet buffer address Position */
#define ETH_TPSF_TPB1ADR_Msk                  (_UINT32_(0x3FF) << ETH_TPSF_TPB1ADR_Pos)            /* (ETH_TPSF) TX packet buffer address Mask */
#define ETH_TPSF_TPB1ADR(value)               (ETH_TPSF_TPB1ADR_Msk & (_UINT32_(value) << ETH_TPSF_TPB1ADR_Pos)) /* Assigment of value for TPB1ADR in the ETH_TPSF register */
#define ETH_TPSF_ENTXP_Pos                    _UINT32_(31)                                         /* (ETH_TPSF) Enable TX partial store and forward operation Position */
#define ETH_TPSF_ENTXP_Msk                    (_UINT32_(0x1) << ETH_TPSF_ENTXP_Pos)                /* (ETH_TPSF) Enable TX partial store and forward operation Mask */
#define ETH_TPSF_ENTXP(value)                 (ETH_TPSF_ENTXP_Msk & (_UINT32_(value) << ETH_TPSF_ENTXP_Pos)) /* Assigment of value for ENTXP in the ETH_TPSF register */
#define ETH_TPSF_Msk                          _UINT32_(0x800003FF)                                 /* (ETH_TPSF) Register Mask  */


/* -------- ETH_TSH : (ETH Offset: 0x11C0) (R/W 32) 1588 Timer Seconds High [15:0] Register -------- */
#define ETH_TSH_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TSH) 1588 Timer Seconds High [15:0] Register  Reset Value */

#define ETH_TSH_TCS_Pos                       _UINT32_(0)                                          /* (ETH_TSH) Timer Count in Seconds Position */
#define ETH_TSH_TCS_Msk                       (_UINT32_(0xFFFF) << ETH_TSH_TCS_Pos)                /* (ETH_TSH) Timer Count in Seconds Mask */
#define ETH_TSH_TCS(value)                    (ETH_TSH_TCS_Msk & (_UINT32_(value) << ETH_TSH_TCS_Pos)) /* Assigment of value for TCS in the ETH_TSH register */
#define ETH_TSH_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_TSH) Register Mask  */


/* -------- ETH_TSL : (ETH Offset: 0x11D0) (R/W 32) 1588 Timer Seconds [31:0] Register -------- */
#define ETH_TSL_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TSL) 1588 Timer Seconds [31:0] Register  Reset Value */

