Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
#define ETH_TSL_TCS_Pos                       _UINT32_(0)                                          /* (ETH_TSL) Timer Count in Seconds Position */
#define ETH_TSL_TCS_Msk                       (_UINT32_(0xFFFFFFFF) << ETH_TSL_TCS_Pos)            /* (ETH_TSL) Timer Count in Seconds Mask */
#define ETH_TSL_TCS(value)                    (ETH_TSL_TCS_Msk & (_UINT32_(value) << ETH_TSL_TCS_Pos)) /* Assigment of value for TCS in the ETH_TSL register */
#define ETH_TSL_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_TSL) Register Mask  */


/* -------- ETH_TSR : (ETH Offset: 0x1014) (R/W 32) Transmit Status Register -------- */
#define ETH_TSR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TSR) Transmit Status Register  Reset Value */

#define ETH_TSR_UBR_Pos                       _UINT32_(0)                                          /* (ETH_TSR) Used Bit Read Position */
#define ETH_TSR_UBR_Msk                       (_UINT32_(0x1) << ETH_TSR_UBR_Pos)                   /* (ETH_TSR) Used Bit Read Mask */
#define ETH_TSR_UBR(value)                    (ETH_TSR_UBR_Msk & (_UINT32_(value) << ETH_TSR_UBR_Pos)) /* Assigment of value for UBR in the ETH_TSR register */
#define ETH_TSR_COL_Pos                       _UINT32_(1)                                          /* (ETH_TSR) Collision Occurred Position */
#define ETH_TSR_COL_Msk                       (_UINT32_(0x1) << ETH_TSR_COL_Pos)                   /* (ETH_TSR) Collision Occurred Mask */
#define ETH_TSR_COL(value)                    (ETH_TSR_COL_Msk & (_UINT32_(value) << ETH_TSR_COL_Pos)) /* Assigment of value for COL in the ETH_TSR register */
#define ETH_TSR_RLE_Pos                       _UINT32_(2)                                          /* (ETH_TSR) Retry Limit Exceeded Position */
#define ETH_TSR_RLE_Msk                       (_UINT32_(0x1) << ETH_TSR_RLE_Pos)                   /* (ETH_TSR) Retry Limit Exceeded Mask */
#define ETH_TSR_RLE(value)                    (ETH_TSR_RLE_Msk & (_UINT32_(value) << ETH_TSR_RLE_Pos)) /* Assigment of value for RLE in the ETH_TSR register */
#define ETH_TSR_TXGO_Pos                      _UINT32_(3)                                          /* (ETH_TSR) Transmit Go Position */
#define ETH_TSR_TXGO_Msk                      (_UINT32_(0x1) << ETH_TSR_TXGO_Pos)                  /* (ETH_TSR) Transmit Go Mask */
#define ETH_TSR_TXGO(value)                   (ETH_TSR_TXGO_Msk & (_UINT32_(value) << ETH_TSR_TXGO_Pos)) /* Assigment of value for TXGO in the ETH_TSR register */
#define ETH_TSR_TFC_Pos                       _UINT32_(4)                                          /* (ETH_TSR) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_TSR_TFC_Msk                       (_UINT32_(0x1) << ETH_TSR_TFC_Pos)                   /* (ETH_TSR) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_TSR_TFC(value)                    (ETH_TSR_TFC_Msk & (_UINT32_(value) << ETH_TSR_TFC_Pos)) /* Assigment of value for TFC in the ETH_TSR register */
#define ETH_TSR_TXCOMP_Pos                    _UINT32_(5)                                          /* (ETH_TSR) Transmit Complete Position */
#define ETH_TSR_TXCOMP_Msk                    (_UINT32_(0x1) << ETH_TSR_TXCOMP_Pos)                /* (ETH_TSR) Transmit Complete Mask */
#define ETH_TSR_TXCOMP(value)                 (ETH_TSR_TXCOMP_Msk & (_UINT32_(value) << ETH_TSR_TXCOMP_Pos)) /* Assigment of value for TXCOMP in the ETH_TSR register */
#define ETH_TSR_UND_Pos                       _UINT32_(6)                                          /* (ETH_TSR) Transmit Underrun Position */
#define ETH_TSR_UND_Msk                       (_UINT32_(0x1) << ETH_TSR_UND_Pos)                   /* (ETH_TSR) Transmit Underrun Mask */
#define ETH_TSR_UND(value)                    (ETH_TSR_UND_Msk & (_UINT32_(value) << ETH_TSR_UND_Pos)) /* Assigment of value for UND in the ETH_TSR register */
#define ETH_TSR_LCOL_Pos                      _UINT32_(7)                                          /* (ETH_TSR) Late Colision Occured Position */
#define ETH_TSR_LCOL_Msk                      (_UINT32_(0x1) << ETH_TSR_LCOL_Pos)                  /* (ETH_TSR) Late Colision Occured Mask */
#define ETH_TSR_LCOL(value)                   (ETH_TSR_LCOL_Msk & (_UINT32_(value) << ETH_TSR_LCOL_Pos)) /* Assigment of value for LCOL in the ETH_TSR register */
#define ETH_TSR_HRESP_Pos                     _UINT32_(8)                                          /* (ETH_TSR) HRESP Not OK Position */
#define ETH_TSR_HRESP_Msk                     (_UINT32_(0x1) << ETH_TSR_HRESP_Pos)                 /* (ETH_TSR) HRESP Not OK Mask */
#define ETH_TSR_HRESP(value)                  (ETH_TSR_HRESP_Msk & (_UINT32_(value) << ETH_TSR_HRESP_Pos)) /* Assigment of value for HRESP in the ETH_TSR register */
#define ETH_TSR_Msk                           _UINT32_(0x000001FF)                                 /* (ETH_TSR) Register Mask  */


/* -------- ETH_TSSN : (ETH Offset: 0x11CC) (R/W 32) 1588 Timer Sync Strobe Nanoseconds Register -------- */
#define ETH_TSSN_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_TSSN) 1588 Timer Sync Strobe Nanoseconds Register  Reset Value */

#define ETH_TSSN_VTN_Pos                      _UINT32_(0)                                          /* (ETH_TSSN) Value Timer Nanoseconds Register Capture Position */
#define ETH_TSSN_VTN_Msk                      (_UINT32_(0x3FFFFFFF) << ETH_TSSN_VTN_Pos)           /* (ETH_TSSN) Value Timer Nanoseconds Register Capture Mask */
#define ETH_TSSN_VTN(value)                   (ETH_TSSN_VTN_Msk & (_UINT32_(value) << ETH_TSSN_VTN_Pos)) /* Assigment of value for VTN in the ETH_TSSN register */
#define ETH_TSSN_Msk                          _UINT32_(0x3FFFFFFF)                                 /* (ETH_TSSN) Register Mask  */


/* -------- ETH_TSSSL : (ETH Offset: 0x11C8) (R/W 32) 1588 Timer Sync Strobe Seconds [31:0] Register -------- */
#define ETH_TSSSL_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_TSSSL) 1588 Timer Sync Strobe Seconds [31:0] Register  Reset Value */

#define ETH_TSSSL_VTS_Pos                     _UINT32_(0)                                          /* (ETH_TSSSL) Value of Timer Seconds Register Capture Position */
#define ETH_TSSSL_VTS_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_TSSSL_VTS_Pos)          /* (ETH_TSSSL) Value of Timer Seconds Register Capture Mask */
#define ETH_TSSSL_VTS(value)                  (ETH_TSSSL_VTS_Msk & (_UINT32_(value) << ETH_TSSSL_VTS_Pos)) /* Assigment of value for VTS in the ETH_TSSSL register */
#define ETH_TSSSL_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_TSSSL) Register Mask  */


