Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
/* -------- ETH_TUR : (ETH Offset: 0x1134) ( R/ 32) Transmit Underruns Register -------- */
#define ETH_TUR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TUR) Transmit Underruns Register  Reset Value */

#define ETH_TUR_TXUNR_Pos                     _UINT32_(0)                                          /* (ETH_TUR) Transmit Underruns Position */
#define ETH_TUR_TXUNR_Msk                     (_UINT32_(0x3FF) << ETH_TUR_TXUNR_Pos)               /* (ETH_TUR) Transmit Underruns Mask */
#define ETH_TUR_TXUNR(value)                  (ETH_TUR_TXUNR_Msk & (_UINT32_(value) << ETH_TUR_TXUNR_Pos)) /* Assigment of value for TXUNR in the ETH_TUR register */
#define ETH_TUR_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_TUR) Register Mask  */


/* -------- ETH_UCE : (ETH Offset: 0x11B0) ( R/ 32) UDP Checksum Errors Register -------- */
#define ETH_UCE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_UCE) UDP Checksum Errors Register  Reset Value */

#define ETH_UCE_UCKER_Pos                     _UINT32_(0)                                          /* (ETH_UCE) UDP Checksum Errors Position */
#define ETH_UCE_UCKER_Msk                     (_UINT32_(0xFF) << ETH_UCE_UCKER_Pos)                /* (ETH_UCE) UDP Checksum Errors Mask */
#define ETH_UCE_UCKER(value)                  (ETH_UCE_UCKER_Msk & (_UINT32_(value) << ETH_UCE_UCKER_Pos)) /* Assigment of value for UCKER in the ETH_UCE register */
#define ETH_UCE_Msk                           _UINT32_(0x000000FF)                                 /* (ETH_UCE) Register Mask  */


/* -------- ETH_UFR : (ETH Offset: 0x1184) ( R/ 32) Undersize Frames Received Register -------- */
#define ETH_UFR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_UFR) Undersize Frames Received Register  Reset Value */

#define ETH_UFR_UFRX_Pos                      _UINT32_(0)                                          /* (ETH_UFR) Undersize Frames Received Position */
#define ETH_UFR_UFRX_Msk                      (_UINT32_(0x3FF) << ETH_UFR_UFRX_Pos)                /* (ETH_UFR) Undersize Frames Received Mask */
#define ETH_UFR_UFRX(value)                   (ETH_UFR_UFRX_Msk & (_UINT32_(value) << ETH_UFR_UFRX_Pos)) /* Assigment of value for UFRX in the ETH_UFR register */
#define ETH_UFR_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_UFR) Register Mask  */


/* -------- ETH_UR : (ETH Offset: 0x100C) (R/W 32) User Register -------- */
#define ETH_UR_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_UR) User Register  Reset Value */

#define ETH_UR_UO_Pos                         _UINT32_(0)                                          /* (ETH_UR) User Programmable Outputs Position */
#define ETH_UR_UO_Msk                         (_UINT32_(0xFFFF) << ETH_UR_UO_Pos)                  /* (ETH_UR) User Programmable Outputs Mask */
#define ETH_UR_UO(value)                      (ETH_UR_UO_Msk & (_UINT32_(value) << ETH_UR_UO_Pos)) /* Assigment of value for UO in the ETH_UR register */
#define ETH_UR_UI_Pos                         _UINT32_(16)                                         /* (ETH_UR) User Programmable Inputs Position */
#define ETH_UR_UI_Msk                         (_UINT32_(0xFFFF) << ETH_UR_UI_Pos)                  /* (ETH_UR) User Programmable Inputs Mask */
#define ETH_UR_UI(value)                      (ETH_UR_UI_Msk & (_UINT32_(value) << ETH_UR_UI_Pos)) /* Assigment of value for UI in the ETH_UR register */
#define ETH_UR_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (ETH_UR) Register Mask  */


/* -------- ETH_WOL : (ETH Offset: 0x10B8) (R/W 32) Wake on LAN -------- */
#define ETH_WOL_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_WOL) Wake on LAN  Reset Value */

#define ETH_WOL_IP_Pos                        _UINT32_(0)                                          /* (ETH_WOL) IP address Position */
#define ETH_WOL_IP_Msk                        (_UINT32_(0xFFFF) << ETH_WOL_IP_Pos)                 /* (ETH_WOL) IP address Mask */
#define ETH_WOL_IP(value)                     (ETH_WOL_IP_Msk & (_UINT32_(value) << ETH_WOL_IP_Pos)) /* Assigment of value for IP in the ETH_WOL register */
#define ETH_WOL_MAG_Pos                       _UINT32_(16)                                         /* (ETH_WOL) Event enable Position */
#define ETH_WOL_MAG_Msk                       (_UINT32_(0x1) << ETH_WOL_MAG_Pos)                   /* (ETH_WOL) Event enable Mask */
#define ETH_WOL_MAG(value)                    (ETH_WOL_MAG_Msk & (_UINT32_(value) << ETH_WOL_MAG_Pos)) /* Assigment of value for MAG in the ETH_WOL register */
#define ETH_WOL_ARP_Pos                       _UINT32_(17)                                         /* (ETH_WOL) LAN ARP req Position */
#define ETH_WOL_ARP_Msk                       (_UINT32_(0x1) << ETH_WOL_ARP_Pos)                   /* (ETH_WOL) LAN ARP req Mask */
#define ETH_WOL_ARP(value)                    (ETH_WOL_ARP_Msk & (_UINT32_(value) << ETH_WOL_ARP_Pos)) /* Assigment of value for ARP in the ETH_WOL register */
#define ETH_WOL_SA1_Pos                       _UINT32_(18)                                         /* (ETH_WOL) WOL specific address reg 1 Position */
#define ETH_WOL_SA1_Msk                       (_UINT32_(0x1) << ETH_WOL_SA1_Pos)                   /* (ETH_WOL) WOL specific address reg 1 Mask */
#define ETH_WOL_SA1(value)                    (ETH_WOL_SA1_Msk & (_UINT32_(value) << ETH_WOL_SA1_Pos)) /* Assigment of value for SA1 in the ETH_WOL register */
#define ETH_WOL_MTI_Pos                       _UINT32_(19)                                         /* (ETH_WOL) WOL LAN multicast Position */
#define ETH_WOL_MTI_Msk                       (_UINT32_(0x1) << ETH_WOL_MTI_Pos)                   /* (ETH_WOL) WOL LAN multicast Mask */
#define ETH_WOL_MTI(value)                    (ETH_WOL_MTI_Msk & (_UINT32_(value) << ETH_WOL_MTI_Pos)) /* Assigment of value for MTI in the ETH_WOL register */
#define ETH_WOL_Msk                           _UINT32_(0x000FFFFF)                                 /* (ETH_WOL) Register Mask  */

#define ETH_WOL_SA_Pos                        _UINT32_(18)                                         /* (ETH_WOL Position) WOL specific address reg x */
#define ETH_WOL_SA_Msk                        (_UINT32_(0x1) << ETH_WOL_SA_Pos)                    /* (ETH_WOL Mask) SA */
#define ETH_WOL_SA(value)                     (ETH_WOL_SA_Msk & (_UINT32_(value) << ETH_WOL_SA_Pos)) 

/** \brief ETH register offsets definitions */
#define ETH_SAB_REG_OFST               _UINT32_(0x00)      /* (ETH_SAB) Specific Address Bottom [31:0] Register Offset */
#define ETH_SAT_REG_OFST               _UINT32_(0x04)      /* (ETH_SAT) Specific Address Top [47:32] Register Offset */
#define ETH_AE_REG_OFST                _UINT32_(0x119C)    /* (ETH_AE) Alignment Errors Register Offset */
#define ETH_BCFR_REG_OFST              _UINT32_(0x115C)    /* (ETH_BCFR) Broadcast Frames Received Register Offset */
#define ETH_BCFT_REG_OFST              _UINT32_(0x110C)    /* (ETH_BCFT) Broadcast Frames Transmitted Register Offset */
#define ETH_BFR64_REG_OFST             _UINT32_(0x1168)    /* (ETH_BFR64) 64 Byte Frames Received Register Offset */
#define ETH_BFT64_REG_OFST             _UINT32_(0x1118)    /* (ETH_BFT64) 64 Byte Frames Transmitted Register Offset */
#define ETH_CSE_REG_OFST               _UINT32_(0x114C)    /* (ETH_CSE) Carrier Sense Errors Register Offset */
#define ETH_CTRLA_REG_OFST             _UINT32_(0x00)      /* (ETH_CTRLA) CTRLA Register Offset */
#define ETH_CTRLB_REG_OFST             _UINT32_(0x04)      /* (ETH_CTRLB) CTRLB Register Offset */
#define ETH_DCFGR_REG_OFST             _UINT32_(0x1010)    /* (ETH_DCFGR) DMA Configuration Register Offset */
#define ETH_DTF_REG_OFST               _UINT32_(0x1148)    /* (ETH_DTF) Deferred Transmission Frames Register Offset */
#define ETH_EC_REG_OFST                _UINT32_(0x1140)    /* (ETH_EC) Excessive Collisions Register Offset */
#define ETH_EFRN_REG_OFST              _UINT32_(0x11EC)    /* (ETH_EFRN) PTP Event Frame Received Nanoseconds Offset */
#define ETH_EFRSH_REG_OFST             _UINT32_(0x10EC)    /* (ETH_EFRSH) PTP Event Frame Received Seconds High Register Offset */
#define ETH_EFRSL_REG_OFST             _UINT32_(0x11E8)    /* (ETH_EFRSL) PTP Event Frame Received Seconds Low Register Offset */
#define ETH_EFTN_REG_OFST              _UINT32_(0x11E4)    /* (ETH_EFTN) PTP Event Frame Transmitted Nanoseconds Offset */
#define ETH_EFTSH_REG_OFST             _UINT32_(0x10E8)    /* (ETH_EFTSH) PTP Event Frame Transmitted Seconds High Register Offset */
#define ETH_EFTSL_REG_OFST             _UINT32_(0x11E0)    /* (ETH_EFTSL) PTP Event Frame Transmitted Seconds Low Register Offset */
#define ETH_EVCTRL_REG_OFST            _UINT32_(0x0C)      /* (ETH_EVCTRL) Event Control Register Offset */
#define ETH_FCSE_REG_OFST              _UINT32_(0x1190)    /* (ETH_FCSE) Frame Check Sequence Errors Register Offset */
#define ETH_FR_REG_OFST                _UINT32_(0x1158)    /* (ETH_FR) Frames Received Register Offset */
#define ETH_FT_REG_OFST                _UINT32_(0x1108)    /* (ETH_FT) Frames Transmitted Register Offset */
#define ETH_GTBFT1518_REG_OFST         _UINT32_(0x1130)    /* (ETH_GTBFT1518) Greater Than 1518 Byte Frames Transmitted Register Offset */
#define ETH_HRB_REG_OFST               _UINT32_(0x1080)    /* (ETH_HRB) Hash Register Bottom [31:0] Offset */
#define ETH_HRT_REG_OFST               _UINT32_(0x1084)    /* (ETH_HRT) Hash Register Top [63:32] Offset */
#define ETH_IDR_REG_OFST               _UINT32_(0x102C)    /* (ETH_IDR) Interrupt Disable Register Offset */
#define ETH_IER_REG_OFST               _UINT32_(0x1028)    /* (ETH_IER) Interrupt Enable Register Offset */
#define ETH_IHCE_REG_OFST              _UINT32_(0x11A8)    /* (ETH_IHCE) IP Header Checksum Errors Register Offset */
#define ETH_IMR_REG_OFST               _UINT32_(0x1030)    /* (ETH_IMR) Interrupt Mask Register Offset */
#define ETH_IPGS_REG_OFST              _UINT32_(0x10BC)    /* (ETH_IPGS) IPG Stretch Register Offset */
#define ETH_ISR_REG_OFST               _UINT32_(0x1024)    /* (ETH_ISR) Interrupt Status Register Offset */
#define ETH_JR_REG_OFST                _UINT32_(0x118C)    /* (ETH_JR) Jabbers Received Register Offset */
#define ETH_LC_REG_OFST                _UINT32_(0x1144)    /* (ETH_LC) Late Collisions Register Offset */
#define ETH_LFFE_REG_OFST              _UINT32_(0x1194)    /* (ETH_LFFE) Length Field Frame Errors Register Offset */
#define ETH_MAN_REG_OFST               _UINT32_(0x1034)    /* (ETH_MAN) PHY Maintenance Register Offset */
#define ETH_MCF_REG_OFST               _UINT32_(0x113C)    /* (ETH_MCF) Multiple Collision Frames Register Offset */
#define ETH_MFR_REG_OFST               _UINT32_(0x1160)    /* (ETH_MFR) Multicast Frames Received Register Offset */
#define ETH_MFT_REG_OFST               _UINT32_(0x1110)    /* (ETH_MFT) Multicast Frames Transmitted Register Offset */
#define ETH_NCFGR_REG_OFST             _UINT32_(0x1004)    /* (ETH_NCFGR) Network Configuration Register Offset */
#define ETH_NCR_REG_OFST               _UINT32_(0x1000)    /* (ETH_NCR) Network Control Register Offset */
#define ETH_NSC_REG_OFST               _UINT32_(0x10DC)    /* (ETH_NSC) Tsu timer comparison nanoseconds Register Offset */
#define ETH_NSR_REG_OFST               _UINT32_(0x1008)    /* (ETH_NSR) Network Status Register Offset */
#define ETH_OFR_REG_OFST               _UINT32_(0x1188)    /* (ETH_OFR) Oversize Frames Received Register Offset */
#define ETH_ORHI_REG_OFST              _UINT32_(0x1154)    /* (ETH_ORHI) Octets Received [47:32] Received Offset */
#define ETH_ORLO_REG_OFST              _UINT32_(0x1150)    /* (ETH_ORLO) Octets Received [31:0] Received Offset */
#define ETH_OTHI_REG_OFST              _UINT32_(0x1104)    /* (ETH_OTHI) Octets Transmitted [47:32] Register Offset */
#define ETH_OTLO_REG_OFST              _UINT32_(0x1100)    /* (ETH_OTLO) Octets Transmitted [31:0] Register Offset */
#define ETH_PEFRN_REG_OFST             _UINT32_(0x11FC)    /* (ETH_PEFRN) PTP Peer Event Frame Received Nanoseconds Offset */
#define ETH_PEFRSH_REG_OFST            _UINT32_(0x10F4)    /* (ETH_PEFRSH) PTP Peer Event Frame Received Seconds High Register Offset */
#define ETH_PEFRSL_REG_OFST            _UINT32_(0x11F8)    /* (ETH_PEFRSL) PTP Peer Event Frame Received Seconds Low Register Offset */
#define ETH_PEFTN_REG_OFST             _UINT32_(0x11F4)    /* (ETH_PEFTN) PTP Peer Event Frame Transmitted Nanoseconds Offset */
#define ETH_PEFTSH_REG_OFST            _UINT32_(0x10F0)    /* (ETH_PEFTSH) PTP Peer Event Frame Transmitted Seconds High Register Offset */
#define ETH_PEFTSL_REG_OFST            _UINT32_(0x11F0)    /* (ETH_PEFTSL) PTP Peer Event Frame Transmitted Seconds Low Register Offset */
#define ETH_PFR_REG_OFST               _UINT32_(0x1164)    /* (ETH_PFR) Pause Frames Received Register Offset */
#define ETH_PFT_REG_OFST               _UINT32_(0x1114)    /* (ETH_PFT) Pause Frames Transmitted Register Offset */
#define ETH_RBQB_REG_OFST              _UINT32_(0x1018)    /* (ETH_RBQB) Receive Buffer Queue Base Address Offset */
#define ETH_RJFML_REG_OFST             _UINT32_(0x1048)    /* (ETH_RJFML) RX Jumbo Frame Max Length Register Offset */
#define ETH_RLPITI_REG_OFST            _UINT32_(0x1274)    /* (ETH_RLPITI) Receive LPI Time Register Offset */
#define ETH_RLPITR_REG_OFST            _UINT32_(0x1270)    /* (ETH_RLPITR) Receive LPI transition Register Offset */
#define ETH_ROE_REG_OFST               _UINT32_(0x11A4)    /* (ETH_ROE) Receive Overrun Register Offset */
#define ETH_RPQ_REG_OFST               _UINT32_(0x1038)    /* (ETH_RPQ) Received Pause Quantum Register Offset */
#define ETH_RPSF_REG_OFST              _UINT32_(0x1044)    /* (ETH_RPSF) RX partial store and forward Register Offset */
#define ETH_RRE_REG_OFST               _UINT32_(0x11A0)    /* (ETH_RRE) Receive Resource Errors Register Offset */
#define ETH_RSE_REG_OFST               _UINT32_(0x1198)    /* (ETH_RSE) Receive Symbol Errors Register Offset */
#define ETH_RSR_REG_OFST               _UINT32_(0x1020)    /* (ETH_RSR) Receive Status Register Offset */
#define ETH_SAMB1_REG_OFST             _UINT32_(0x10C8)    /* (ETH_SAMB1) Specific Address 1 Mask Bottom [31:0] Register Offset */
#define ETH_SAMT1_REG_OFST             _UINT32_(0x10CC)    /* (ETH_SAMT1) Specific Address 1 Mask Top [47:32] Register Offset */
#define ETH_SCF_REG_OFST               _UINT32_(0x1138)    /* (ETH_SCF) Single Collision Frames Register Offset */
#define ETH_SCH_REG_OFST               _UINT32_(0x10E4)    /* (ETH_SCH) Tsu timer second comparison Register Offset */
#define ETH_SCL_REG_OFST               _UINT32_(0x10E0)    /* (ETH_SCL) Tsu timer second comparison Register Offset */
#define ETH_SVLAN_REG_OFST             _UINT32_(0x10C0)    /* (ETH_SVLAN) Stacked VLAN Register Offset */
#define ETH_SYNCB_REG_OFST             _UINT32_(0x20)      /* (ETH_SYNCB) Sync Busy Register Offset */
#define ETH_TA_REG_OFST                _UINT32_(0x11D8)    /* (ETH_TA) 1588 Timer Adjust Register Offset */
#define ETH_TBFR1023_REG_OFST          _UINT32_(0x1178)    /* (ETH_TBFR1023) 512 to 1023 Byte Frames Received Register Offset */
#define ETH_TBFR127_REG_OFST           _UINT32_(0x116C)    /* (ETH_TBFR127) 65 to 127 Byte Frames Received Register Offset */
#define ETH_TBFR1518_REG_OFST          _UINT32_(0x117C)    /* (ETH_TBFR1518) 1024 to 1518 Byte Frames Received Register Offset */
#define ETH_TBFR255_REG_OFST           _UINT32_(0x1170)    /* (ETH_TBFR255) 128 to 255 Byte Frames Received Register Offset */
#define ETH_TBFR511_REG_OFST           _UINT32_(0x1174)    /* (ETH_TBFR511) 256 to 511Byte Frames Received Register Offset */
#define ETH_TBFT1023_REG_OFST          _UINT32_(0x1128)    /* (ETH_TBFT1023) 512 to 1023 Byte Frames Transmitted Register Offset */
#define ETH_TBFT127_REG_OFST           _UINT32_(0x111C)    /* (ETH_TBFT127) 65 to 127 Byte Frames Transmitted Register Offset */
#define ETH_TBFT1518_REG_OFST          _UINT32_(0x112C)    /* (ETH_TBFT1518) 1024 to 1518 Byte Frames Transmitted Register Offset */
#define ETH_TBFT255_REG_OFST           _UINT32_(0x1120)    /* (ETH_TBFT255) 128 to 255 Byte Frames Transmitted Register Offset */
#define ETH_TBFT511_REG_OFST           _UINT32_(0x1124)    /* (ETH_TBFT511) 256 to 511 Byte Frames Transmitted Register Offset */
#define ETH_TBQB_REG_OFST              _UINT32_(0x101C)    /* (ETH_TBQB) Transmit Buffer Queue Base Address Offset */
#define ETH_TCE_REG_OFST               _UINT32_(0x11AC)    /* (ETH_TCE) TCP Checksum Errors Register Offset */
#define ETH_TI_REG_OFST                _UINT32_(0x11DC)    /* (ETH_TI) 1588 Timer Increment Register Offset */
#define ETH_TIDM_REG_OFST              _UINT32_(0x10A8)    /* (ETH_TIDM) Type ID Match Register Offset */
#define ETH_TIDM0_REG_OFST             _UINT32_(0x10A8)    /* (ETH_TIDM0) Type ID Match Register Offset */
#define ETH_TIDM1_REG_OFST             _UINT32_(0x10AC)    /* (ETH_TIDM1) Type ID Match Register Offset */
#define ETH_TIDM2_REG_OFST             _UINT32_(0x10B0)    /* (ETH_TIDM2) Type ID Match Register Offset */
#define ETH_TIDM3_REG_OFST             _UINT32_(0x10B4)    /* (ETH_TIDM3) Type ID Match Register Offset */
#define ETH_TISUBN_REG_OFST            _UINT32_(0x11BC)    /* (ETH_TISUBN) 1588 Timer Increment [15:0] Sub-Nanoseconds Register Offset */
#define ETH_TLPITI_REG_OFST            _UINT32_(0x127C)    /* (ETH_TLPITI) Receive LPI Time Register Offset */
#define ETH_TLPITR_REG_OFST            _UINT32_(0x1278)    /* (ETH_TLPITR) Receive LPI transition Register Offset */
#define ETH_TMXBFR_REG_OFST            _UINT32_(0x1180)    /* (ETH_TMXBFR) 1519 to Maximum Byte Frames Received Register Offset */
#define ETH_TN_REG_OFST                _UINT32_(0x11D4)    /* (ETH_TN) 1588 Timer Nanoseconds Register Offset */
#define ETH_TPFCP_REG_OFST             _UINT32_(0x10C4)    /* (ETH_TPFCP) Transmit PFC Pause Register Offset */
#define ETH_TPQ_REG_OFST               _UINT32_(0x103C)    /* (ETH_TPQ) Transmit Pause Quantum Register Offset */
#define ETH_TPSF_REG_OFST              _UINT32_(0x1040)    /* (ETH_TPSF) TX partial store and forward Register Offset */
#define ETH_TSH_REG_OFST               _UINT32_(0x11C0)    /* (ETH_TSH) 1588 Timer Seconds High [15:0] Register Offset */
#define ETH_TSL_REG_OFST               _UINT32_(0x11D0)    /* (ETH_TSL) 1588 Timer Seconds [31:0] Register Offset */
#define ETH_TSR_REG_OFST               _UINT32_(0x1014)    /* (ETH_TSR) Transmit Status Register Offset */
#define ETH_TSSN_REG_OFST              _UINT32_(0x11CC)    /* (ETH_TSSN) 1588 Timer Sync Strobe Nanoseconds Register Offset */
#define ETH_TSSSL_REG_OFST             _UINT32_(0x11C8)    /* (ETH_TSSSL) 1588 Timer Sync Strobe Seconds [31:0] Register Offset */
#define ETH_TUR_REG_OFST               _UINT32_(0x1134)    /* (ETH_TUR) Transmit Underruns Register Offset */
#define ETH_UCE_REG_OFST               _UINT32_(0x11B0)    /* (ETH_UCE) UDP Checksum Errors Register Offset */
#define ETH_UFR_REG_OFST               _UINT32_(0x1184)    /* (ETH_UFR) Undersize Frames Received Register Offset */
#define ETH_UR_REG_OFST                _UINT32_(0x100C)    /* (ETH_UR) User Register Offset */
#define ETH_WOL_REG_OFST               _UINT32_(0x10B8)    /* (ETH_WOL) Wake on LAN Offset */

