Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/eth.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SA register API structure */
typedef struct
{
  __IO  uint32_t                       ETH_SAB;            /**< Offset: 0x00 (R/W  32) Specific Address Bottom [31:0] Register */
  __IO  uint32_t                       ETH_SAT;            /**< Offset: 0x04 (R/W  32) Specific Address Top [47:32] Register */
} eth_sa_registers_t;

#define ETH_SA_NUMBER 4

/** \brief ETH register API structure */
typedef struct
{  /* Ethernet Controller */
  __IO  uint32_t                       ETH_CTRLA;          /**< Offset: 0x00 (R/W  32) CTRLA Register */
  __IO  uint32_t                       ETH_CTRLB;          /**< Offset: 0x04 (R/W  32) CTRLB Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       ETH_EVCTRL;         /**< Offset: 0x0C (R/W  32) Event Control Register */
  __I   uint8_t                        Reserved2[0x10];
  __I   uint32_t                       ETH_SYNCB;          /**< Offset: 0x20 (R/   32) Sync Busy Register */
  __I   uint8_t                        Reserved3[0xFDC];
  __IO  uint32_t                       ETH_NCR;            /**< Offset: 0x1000 (R/W  32) Network Control Register */
  __IO  uint32_t                       ETH_NCFGR;          /**< Offset: 0x1004 (R/W  32) Network Configuration Register */
  __I   uint32_t                       ETH_NSR;            /**< Offset: 0x1008 (R/   32) Network Status Register */
  __IO  uint32_t                       ETH_UR;             /**< Offset: 0x100C (R/W  32) User Register */
  __IO  uint32_t                       ETH_DCFGR;          /**< Offset: 0x1010 (R/W  32) DMA Configuration Register */
  __IO  uint32_t                       ETH_TSR;            /**< Offset: 0x1014 (R/W  32) Transmit Status Register */
  __IO  uint32_t                       ETH_RBQB;           /**< Offset: 0x1018 (R/W  32) Receive Buffer Queue Base Address */
  __IO  uint32_t                       ETH_TBQB;           /**< Offset: 0x101C (R/W  32) Transmit Buffer Queue Base Address */
  __IO  uint32_t                       ETH_RSR;            /**< Offset: 0x1020 (R/W  32) Receive Status Register */
  __IO  uint32_t                       ETH_ISR;            /**< Offset: 0x1024 (R/W  32) Interrupt Status Register */
  __O   uint32_t                       ETH_IER;            /**< Offset: 0x1028 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       ETH_IDR;            /**< Offset: 0x102C ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       ETH_IMR;            /**< Offset: 0x1030 (R/   32) Interrupt Mask Register */
  __IO  uint32_t                       ETH_MAN;            /**< Offset: 0x1034 (R/W  32) PHY Maintenance Register */
  __I   uint32_t                       ETH_RPQ;            /**< Offset: 0x1038 (R/   32) Received Pause Quantum Register */
  __IO  uint32_t                       ETH_TPQ;            /**< Offset: 0x103C (R/W  32) Transmit Pause Quantum Register */
  __IO  uint32_t                       ETH_TPSF;           /**< Offset: 0x1040 (R/W  32) TX partial store and forward Register */
  __IO  uint32_t                       ETH_RPSF;           /**< Offset: 0x1044 (R/W  32) RX partial store and forward Register */
  __IO  uint32_t                       ETH_RJFML;          /**< Offset: 0x1048 (R/W  32) RX Jumbo Frame Max Length Register */
  __I   uint8_t                        Reserved4[0x34];
  __IO  uint32_t                       ETH_HRB;            /**< Offset: 0x1080 (R/W  32) Hash Register Bottom [31:0] */
  __IO  uint32_t                       ETH_HRT;            /**< Offset: 0x1084 (R/W  32) Hash Register Top [63:32] */
        eth_sa_registers_t             SA[ETH_SA_NUMBER]; /**< Offset: 0x1088  */
  __IO  uint32_t                       ETH_TIDM[4];        /**< Offset: 0x10A8 (R/W  32) Type ID Match Register */
  __IO  uint32_t                       ETH_WOL;            /**< Offset: 0x10B8 (R/W  32) Wake on LAN */
  __IO  uint32_t                       ETH_IPGS;           /**< Offset: 0x10BC (R/W  32) IPG Stretch Register */
  __IO  uint32_t                       ETH_SVLAN;          /**< Offset: 0x10C0 (R/W  32) Stacked VLAN Register */
  __IO  uint32_t                       ETH_TPFCP;          /**< Offset: 0x10C4 (R/W  32) Transmit PFC Pause Register */
  __IO  uint32_t                       ETH_SAMB1;          /**< Offset: 0x10C8 (R/W  32) Specific Address 1 Mask Bottom [31:0] Register */
  __IO  uint32_t                       ETH_SAMT1;          /**< Offset: 0x10CC (R/W  32) Specific Address 1 Mask Top [47:32] Register */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       ETH_NSC;            /**< Offset: 0x10DC (R/W  32) Tsu timer comparison nanoseconds Register */
  __IO  uint32_t                       ETH_SCL;            /**< Offset: 0x10E0 (R/W  32) Tsu timer second comparison Register */
  __IO  uint32_t                       ETH_SCH;            /**< Offset: 0x10E4 (R/W  32) Tsu timer second comparison Register */
  __I   uint32_t                       ETH_EFTSH;          /**< Offset: 0x10E8 (R/   32) PTP Event Frame Transmitted Seconds High Register */
  __I   uint32_t                       ETH_EFRSH;          /**< Offset: 0x10EC (R/   32) PTP Event Frame Received Seconds High Register */
  __I   uint32_t                       ETH_PEFTSH;         /**< Offset: 0x10F0 (R/   32) PTP Peer Event Frame Transmitted Seconds High Register */
  __I   uint32_t                       ETH_PEFRSH;         /**< Offset: 0x10F4 (R/   32) PTP Peer Event Frame Received Seconds High Register */
  __I   uint8_t                        Reserved6[0x08];
  __I   uint32_t                       ETH_OTLO;           /**< Offset: 0x1100 (R/   32) Octets Transmitted [31:0] Register */
  __I   uint32_t                       ETH_OTHI;           /**< Offset: 0x1104 (R/   32) Octets Transmitted [47:32] Register */
  __I   uint32_t                       ETH_FT;             /**< Offset: 0x1108 (R/   32) Frames Transmitted Register */
  __I   uint32_t                       ETH_BCFT;           /**< Offset: 0x110C (R/   32) Broadcast Frames Transmitted Register */
  __I   uint32_t                       ETH_MFT;            /**< Offset: 0x1110 (R/   32) Multicast Frames Transmitted Register */
  __I   uint32_t                       ETH_PFT;            /**< Offset: 0x1114 (R/   32) Pause Frames Transmitted Register */
  __I   uint32_t                       ETH_BFT64;          /**< Offset: 0x1118 (R/   32) 64 Byte Frames Transmitted Register */
  __I   uint32_t                       ETH_TBFT127;        /**< Offset: 0x111C (R/   32) 65 to 127 Byte Frames Transmitted Register */
  __I   uint32_t                       ETH_TBFT255;        /**< Offset: 0x1120 (R/   32) 128 to 255 Byte Frames Transmitted Register */
  __I   uint32_t                       ETH_TBFT511;        /**< Offset: 0x1124 (R/   32) 256 to 511 Byte Frames Transmitted Register */
  __I   uint32_t                       ETH_TBFT1023;       /**< Offset: 0x1128 (R/   32) 512 to 1023 Byte Frames Transmitted Register */
  __I   uint32_t                       ETH_TBFT1518;       /**< Offset: 0x112C (R/   32) 1024 to 1518 Byte Frames Transmitted Register */
  __I   uint32_t                       ETH_GTBFT1518;      /**< Offset: 0x1130 (R/   32) Greater Than 1518 Byte Frames Transmitted Register */
  __I   uint32_t                       ETH_TUR;            /**< Offset: 0x1134 (R/   32) Transmit Underruns Register */
  __I   uint32_t                       ETH_SCF;            /**< Offset: 0x1138 (R/   32) Single Collision Frames Register */
  __I   uint32_t                       ETH_MCF;            /**< Offset: 0x113C (R/   32) Multiple Collision Frames Register */
  __I   uint32_t                       ETH_EC;             /**< Offset: 0x1140 (R/   32) Excessive Collisions Register */
  __I   uint32_t                       ETH_LC;             /**< Offset: 0x1144 (R/   32) Late Collisions Register */
  __I   uint32_t                       ETH_DTF;            /**< Offset: 0x1148 (R/   32) Deferred Transmission Frames Register */
  __I   uint32_t                       ETH_CSE;            /**< Offset: 0x114C (R/   32) Carrier Sense Errors Register */
  __I   uint32_t                       ETH_ORLO;           /**< Offset: 0x1150 (R/   32) Octets Received [31:0] Received */
  __I   uint32_t                       ETH_ORHI;           /**< Offset: 0x1154 (R/   32) Octets Received [47:32] Received */
  __I   uint32_t                       ETH_FR;             /**< Offset: 0x1158 (R/   32) Frames Received Register */
  __I   uint32_t                       ETH_BCFR;           /**< Offset: 0x115C (R/   32) Broadcast Frames Received Register */
  __I   uint32_t                       ETH_MFR;            /**< Offset: 0x1160 (R/   32) Multicast Frames Received Register */
  __I   uint32_t                       ETH_PFR;            /**< Offset: 0x1164 (R/   32) Pause Frames Received Register */
  __I   uint32_t                       ETH_BFR64;          /**< Offset: 0x1168 (R/   32) 64 Byte Frames Received Register */
  __I   uint32_t                       ETH_TBFR127;        /**< Offset: 0x116C (R/   32) 65 to 127 Byte Frames Received Register */
  __I   uint32_t                       ETH_TBFR255;        /**< Offset: 0x1170 (R/   32) 128 to 255 Byte Frames Received Register */
  __I   uint32_t                       ETH_TBFR511;        /**< Offset: 0x1174 (R/   32) 256 to 511Byte Frames Received Register */
  __I   uint32_t                       ETH_TBFR1023;       /**< Offset: 0x1178 (R/   32) 512 to 1023 Byte Frames Received Register */
  __I   uint32_t                       ETH_TBFR1518;       /**< Offset: 0x117C (R/   32) 1024 to 1518 Byte Frames Received Register */
  __I   uint32_t                       ETH_TMXBFR;         /**< Offset: 0x1180 (R/   32) 1519 to Maximum Byte Frames Received Register */
  __I   uint32_t                       ETH_UFR;            /**< Offset: 0x1184 (R/   32) Undersize Frames Received Register */
  __I   uint32_t                       ETH_OFR;            /**< Offset: 0x1188 (R/   32) Oversize Frames Received Register */
  __I   uint32_t                       ETH_JR;             /**< Offset: 0x118C (R/   32) Jabbers Received Register */
  __I   uint32_t                       ETH_FCSE;           /**< Offset: 0x1190 (R/   32) Frame Check Sequence Errors Register */
  __I   uint32_t                       ETH_LFFE;           /**< Offset: 0x1194 (R/   32) Length Field Frame Errors Register */
  __I   uint32_t                       ETH_RSE;            /**< Offset: 0x1198 (R/   32) Receive Symbol Errors Register */
  __I   uint32_t                       ETH_AE;             /**< Offset: 0x119C (R/   32) Alignment Errors Register */
  __I   uint32_t                       ETH_RRE;            /**< Offset: 0x11A0 (R/   32) Receive Resource Errors Register */
  __I   uint32_t                       ETH_ROE;            /**< Offset: 0x11A4 (R/   32) Receive Overrun Register */
  __I   uint32_t                       ETH_IHCE;           /**< Offset: 0x11A8 (R/   32) IP Header Checksum Errors Register */
  __I   uint32_t                       ETH_TCE;            /**< Offset: 0x11AC (R/   32) TCP Checksum Errors Register */
  __I   uint32_t                       ETH_UCE;            /**< Offset: 0x11B0 (R/   32) UDP Checksum Errors Register */
  __I   uint8_t                        Reserved7[0x08];
  __IO  uint32_t                       ETH_TISUBN;         /**< Offset: 0x11BC (R/W  32) 1588 Timer Increment [15:0] Sub-Nanoseconds Register */
  __IO  uint32_t                       ETH_TSH;            /**< Offset: 0x11C0 (R/W  32) 1588 Timer Seconds High [15:0] Register */
  __I   uint8_t                        Reserved8[0x04];
  __IO  uint32_t                       ETH_TSSSL;          /**< Offset: 0x11C8 (R/W  32) 1588 Timer Sync Strobe Seconds [31:0] Register */
  __IO  uint32_t                       ETH_TSSN;           /**< Offset: 0x11CC (R/W  32) 1588 Timer Sync Strobe Nanoseconds Register */
  __IO  uint32_t                       ETH_TSL;            /**< Offset: 0x11D0 (R/W  32) 1588 Timer Seconds [31:0] Register */
  __IO  uint32_t                       ETH_TN;             /**< Offset: 0x11D4 (R/W  32) 1588 Timer Nanoseconds Register */
  __O   uint32_t                       ETH_TA;             /**< Offset: 0x11D8 ( /W  32) 1588 Timer Adjust Register */
  __IO  uint32_t                       ETH_TI;             /**< Offset: 0x11DC (R/W  32) 1588 Timer Increment Register */
  __I   uint32_t                       ETH_EFTSL;          /**< Offset: 0x11E0 (R/   32) PTP Event Frame Transmitted Seconds Low Register */
  __I   uint32_t                       ETH_EFTN;           /**< Offset: 0x11E4 (R/   32) PTP Event Frame Transmitted Nanoseconds */
  __I   uint32_t                       ETH_EFRSL;          /**< Offset: 0x11E8 (R/   32) PTP Event Frame Received Seconds Low Register */
  __I   uint32_t                       ETH_EFRN;           /**< Offset: 0x11EC (R/   32) PTP Event Frame Received Nanoseconds */
  __I   uint32_t                       ETH_PEFTSL;         /**< Offset: 0x11F0 (R/   32) PTP Peer Event Frame Transmitted Seconds Low Register */
  __I   uint32_t                       ETH_PEFTN;          /**< Offset: 0x11F4 (R/   32) PTP Peer Event Frame Transmitted Nanoseconds */
  __I   uint32_t                       ETH_PEFRSL;         /**< Offset: 0x11F8 (R/   32) PTP Peer Event Frame Received Seconds Low Register */
  __I   uint32_t                       ETH_PEFRN;          /**< Offset: 0x11FC (R/   32) PTP Peer Event Frame Received Nanoseconds */
  __I   uint8_t                        Reserved9[0x70];
  __I   uint32_t                       ETH_RLPITR;         /**< Offset: 0x1270 (R/   32) Receive LPI transition Register */
  __I   uint32_t                       ETH_RLPITI;         /**< Offset: 0x1274 (R/   32) Receive LPI Time Register */
  __I   uint32_t                       ETH_TLPITR;         /**< Offset: 0x1278 (R/   32) Receive LPI transition Register */
  __I   uint32_t                       ETH_TLPITI;         /**< Offset: 0x127C (R/   32) Receive LPI Time Register */
} eth_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CKSG01_ETH_COMPONENT_H_ */
